# -*- org-adapt-indentation: nil; org-edit-src-content-indentation: 0; orgstrap-cypher: sha256; orgstrap-norm-func-name: orgstrap-norm-func--prp-1\.1; orgstrap-block-checksum: 93bfa8161f556112d8fb98f5576200a6d642293f29d3c6034acced48980bcc25; -*-
# [[orgstrap][jump to the orgstrap block for this file]]
# [[file:queries.html]]

#+title: SPARC queries

#+options: ^:nil

# TODO consider a setup file for these maybe?
# or populate additional local curies via orgstrap
# FIXME doi collides which is bad
#+link: doi https://doi.org/
#+link: PMID http://www.ncbi.nlm.nih.gov/pubmed/
#+link: dataset https://api.pennsieve.io/datasets/N:dataset:
#+link: datasetbf https://api.blackfynn.io/datasets/N:dataset:
#+link: TEMP http://uri.interlex.org/temp/uris/
#+link: TEMPRAW http://uri.interlex.org/temp/uris/raw/
#+link: awards http://uri.interlex.org/temp/uris/awards/
#+link: rdf http://www.w3.org/1999/02/22-rdf-syntax-ns#
#+link: FMA http://purl.org/sig/ont/fma/fma
#+link: IAO http://purl.obolibrary.org/obo/IAO_
#+link: UBERON http://purl.obolibrary.org/obo/UBERON_
#+link: NCBITaxon http://purl.obolibrary.org/obo/NCBITaxon_
#+link: PATO http://purl.obolibrary.org/obo/PATO_
#+link: CHEBI http://purl.obolibrary.org/obo/CHEBI_
#+link: GO http://purl.obolibrary.org/obo/GO_
#+link: CL http://purl.obolibrary.org/obo/CL_
#+link: EMAPA http://purl.obolibrary.org/obo/EMAPA_
#+link: oboInOwl http://www.geneontology.org/formats/oboInOwl#
#+link: BIRNLEX http://uri.neuinfo.org/nif/nifstd/birnlex_
#+link: owl http://www.w3.org/2002/07/owl#
#+link: rdfs http://www.w3.org/2000/01/rdf-schema#
#+link: dc http://purl.org/dc/elements/1.1/
#+link: ILX http://uri.interlex.org/base/ilx_
#+link: ilxtr http://uri.interlex.org/tgbugs/uris/readable/
#+link: tech http://uri.interlex.org/tgbugs/uris/readable/technique/
#+link: asp http://uri.interlex.org/tgbugs/uris/readable/aspect/
#+link: unit http://uri.interlex.org/tgbugs/uris/readable/aspect/unit/
#+link: ilxtio http://uri.interlex.org/tgbugs/uris/indexes/ontologies/
#+link: hyp-protcur https://uilx.org/tgbugs/u/hypothesis/protcur/
#+link: NLXINV http://uri.neuinfo.org/nif/nifstd/nlx_inv_
#+link: SAO http://uri.neuinfo.org/nif/nifstd/sao
#+link: NLX http://uri.neuinfo.org/nif/nifstd/nlx_
#+link: pio.api https://www.protocols.io/api/v3/protocols/
#+link: pio.view https://www.protocols.io/view/
#+link: ror https://ror.org/
#+link: SCR http://scicrunch.org/resolver/SCR_
#+link: apinatomy https://apinatomy.org/uris/readable/
#+link: elements https://apinatomy.org/uris/elements/
#+link: aacar https://apinatomy.org/uris/models/ard-arm-cardiac/ids/
#+link: bolew https://apinatomy.org/uris/models/bolser-lewis/ids/
#+link: kblad https://apinatomy.org/uris/models/keast-bladder/ids/
#+link: bromo https://apinatomy.org/uris/models/bronchomotor/ids/
#+link: scaft https://apinatomy.org/uris/models/scaffold-test/ids/
#+link: vagnr https://apinatomy.org/uris/models/vagus-nerve/ids/
#+link: sdcol https://apinatomy.org/uris/models/sawg-distal-colon/ids/
# FIXME definition is not expanding as expected, probably because my
# implementation is wrong?? but only occasionally? other times it works ??
#+link: definition http://purl.obolibrary.org/obo/IAO_0000115

#+property: header-args :eval no-export
* SPARQL
:PROPERTIES:
:header-args:sparql: :url http://localhost:9999/blazegraph/sparql
:header-args:sparql+: :format text/csv
:header-args:sparql+: :results table
:header-args:sparql+: :var limit="10"
:END:
# :header-args:sparql: :url http://localhost:10035/repositories/test
** Datasets
*** Dataset Predicates
#+begin_src sparql
SELECT DISTINCT
?p
# ?pp
# ?po
WHERE {
  ?dataset a sparc:Dataset .
  ?dataset ?p ?o .
  # ?p ?pp ?po .
} ORDER BY ?p
#+end_src

#+RESULTS:
| p                                        |
|------------------------------------------|
| IAO:0000136                              |
| dc:description                           |
| dc:title                                 |
| TEMP:collectionTitle                     |
| TEMP:completenessOfDataset               |
| TEMP:contentsWereUpdatedAtTime           |
| TEMP:curationIndex                       |
| TEMP:errorIndex                          |
| TEMP:hasAdditionalFundingInformation     |
| TEMP:hasAwardNumber                      |
| TEMP:hasContactPerson                    |
| TEMP:hasDatasetTemplateSchemaVersion     |
| TEMP:hasDoi                              |
| TEMP:hasExpectedNumberOfSamples          |
| TEMP:hasExpectedNumberOfSubjects         |
| TEMP:hasExperimentalApproach             |
| TEMP:hasNumberOfContributors             |
| TEMP:hasNumberOfDirectories              |
| TEMP:hasNumberOfFiles                    |
| TEMP:hasNumberOfSamples                  |
| TEMP:hasNumberOfSubjects                 |
| TEMP:hasProtocol                         |
| TEMP:hasResponsiblePrincipalInvestigator |
| TEMP:hasSizeInBytes                      |
| TEMP:hasUriApi                           |
| TEMP:hasUriHuman                         |
| TEMP:isAboutParticipant                  |
| TEMP:isDescribedBy                       |
| TEMP:milestoneCompletionDate             |
| TEMP:protocolEmploysTechnique            |
| TEMP:statusOnPlatform                    |
| TEMP:submissionIndex                     |
| TEMP:unclassifiedIndex                   |
| TEMP:unclassifiedStages                  |
| TEMP:wasCreatedAtTime                    |
| TEMP:wasUpdatedAtTime                    |
| rdf:type                                 |
| rdfs:label                               |
*** Test
**** Dataset about
#+begin_src sparql
SELECT DISTINCT
?dataset
?about
WHERE {
    ?dataset rdf:type sparc:Dataset .
    ?dataset isAbout: ?about .
}
LIMIT ?limit
#+end_src

#+RESULTS:
| dataset                                      | about                                       |
|----------------------------------------------+---------------------------------------------|
| dataset:013224e7-e3e3-4d8a-90ef-d1b237323eff | cardiac                                     |
| dataset:013224e7-e3e3-4d8a-90ef-d1b237323eff | elelectrophysiology                         |
| dataset:013224e7-e3e3-4d8a-90ef-d1b237323eff | patch clamp                                 |
| dataset:013224e7-e3e3-4d8a-90ef-d1b237323eff | UBERON:0002240                              |
| dataset:0170271a-8fac-4769-a8f5-2b9520291d03 | Laser Capture Microdissection               |
| dataset:0170271a-8fac-4769-a8f5-2b9520291d03 | Molecular Phenotype Gradients of Cell Types |
| dataset:0170271a-8fac-4769-a8f5-2b9520291d03 | Rat Intracardiac Neurons                    |
| dataset:0170271a-8fac-4769-a8f5-2b9520291d03 | Single Neuron Transcriptomics               |
| dataset:0170271a-8fac-4769-a8f5-2b9520291d03 | NCBITaxon:10116                             |
| dataset:0170271a-8fac-4769-a8f5-2b9520291d03 | UBERON:0000948                              |
**** Dataset subjects
#+name: dataset-subjects
#+begin_src sparql
SELECT DISTINCT
?dataset
?subj
WHERE {
    ?startsubj a sparc:Subject .
    ?startsubj TEMP:hasDerivedInformationAsParticipant ?dataset .
    ?subj a sparc:Subject .
    ?subj  TEMP:hasDerivedInformationAsParticipant ?dataset .
}
LIMIT ?limit
#+end_src

#+call: dataset-subjects(startsubj="<https://api.pennsieve.io/datasets/N:dataset:07c31ef4-cc72-4348-813a-f074675643ed/subjects/sub-STxF_19>", limit="100")

#+RESULTS:
| dataset                                      | subj                                                              |
|----------------------------------------------+-------------------------------------------------------------------|
| dataset:07c31ef4-cc72-4348-813a-f074675643ed | dataset:07c31ef4-cc72-4348-813a-f074675643ed/subjects/sub-IF_01   |
| dataset:07c31ef4-cc72-4348-813a-f074675643ed | dataset:07c31ef4-cc72-4348-813a-f074675643ed/subjects/sub-IF_03   |
| dataset:07c31ef4-cc72-4348-813a-f074675643ed | dataset:07c31ef4-cc72-4348-813a-f074675643ed/subjects/sub-IF_04   |
| dataset:07c31ef4-cc72-4348-813a-f074675643ed | dataset:07c31ef4-cc72-4348-813a-f074675643ed/subjects/sub-IF_06   |
| dataset:07c31ef4-cc72-4348-813a-f074675643ed | dataset:07c31ef4-cc72-4348-813a-f074675643ed/subjects/sub-IF_07   |
| dataset:07c31ef4-cc72-4348-813a-f074675643ed | dataset:07c31ef4-cc72-4348-813a-f074675643ed/subjects/sub-IF_08   |
| dataset:07c31ef4-cc72-4348-813a-f074675643ed | dataset:07c31ef4-cc72-4348-813a-f074675643ed/subjects/sub-IF_09   |
| dataset:07c31ef4-cc72-4348-813a-f074675643ed | dataset:07c31ef4-cc72-4348-813a-f074675643ed/subjects/sub-IF_10   |
| dataset:07c31ef4-cc72-4348-813a-f074675643ed | dataset:07c31ef4-cc72-4348-813a-f074675643ed/subjects/sub-IF_11   |
| dataset:07c31ef4-cc72-4348-813a-f074675643ed | dataset:07c31ef4-cc72-4348-813a-f074675643ed/subjects/sub-IF_12   |
| dataset:07c31ef4-cc72-4348-813a-f074675643ed | dataset:07c31ef4-cc72-4348-813a-f074675643ed/subjects/sub-IM_07   |
| dataset:07c31ef4-cc72-4348-813a-f074675643ed | dataset:07c31ef4-cc72-4348-813a-f074675643ed/subjects/sub-IM_08   |
| dataset:07c31ef4-cc72-4348-813a-f074675643ed | dataset:07c31ef4-cc72-4348-813a-f074675643ed/subjects/sub-IM_11   |
| dataset:07c31ef4-cc72-4348-813a-f074675643ed | dataset:07c31ef4-cc72-4348-813a-f074675643ed/subjects/sub-IM_13   |
| dataset:07c31ef4-cc72-4348-813a-f074675643ed | dataset:07c31ef4-cc72-4348-813a-f074675643ed/subjects/sub-IM_14   |
| dataset:07c31ef4-cc72-4348-813a-f074675643ed | dataset:07c31ef4-cc72-4348-813a-f074675643ed/subjects/sub-IM_15   |
| dataset:07c31ef4-cc72-4348-813a-f074675643ed | dataset:07c31ef4-cc72-4348-813a-f074675643ed/subjects/sub-IM_16   |
| dataset:07c31ef4-cc72-4348-813a-f074675643ed | dataset:07c31ef4-cc72-4348-813a-f074675643ed/subjects/sub-STxF_02 |
| dataset:07c31ef4-cc72-4348-813a-f074675643ed | dataset:07c31ef4-cc72-4348-813a-f074675643ed/subjects/sub-STxF_04 |
| dataset:07c31ef4-cc72-4348-813a-f074675643ed | dataset:07c31ef4-cc72-4348-813a-f074675643ed/subjects/sub-STxF_10 |
| dataset:07c31ef4-cc72-4348-813a-f074675643ed | dataset:07c31ef4-cc72-4348-813a-f074675643ed/subjects/sub-STxF_11 |
| dataset:07c31ef4-cc72-4348-813a-f074675643ed | dataset:07c31ef4-cc72-4348-813a-f074675643ed/subjects/sub-STxF_12 |
| dataset:07c31ef4-cc72-4348-813a-f074675643ed | dataset:07c31ef4-cc72-4348-813a-f074675643ed/subjects/sub-STxF_13 |
| dataset:07c31ef4-cc72-4348-813a-f074675643ed | dataset:07c31ef4-cc72-4348-813a-f074675643ed/subjects/sub-STxF_15 |
| dataset:07c31ef4-cc72-4348-813a-f074675643ed | dataset:07c31ef4-cc72-4348-813a-f074675643ed/subjects/sub-STxF_17 |
| dataset:07c31ef4-cc72-4348-813a-f074675643ed | dataset:07c31ef4-cc72-4348-813a-f074675643ed/subjects/sub-STxF_18 |
| dataset:07c31ef4-cc72-4348-813a-f074675643ed | dataset:07c31ef4-cc72-4348-813a-f074675643ed/subjects/sub-STxF_19 |
| dataset:07c31ef4-cc72-4348-813a-f074675643ed | dataset:07c31ef4-cc72-4348-813a-f074675643ed/subjects/sub-STxM_02 |
| dataset:07c31ef4-cc72-4348-813a-f074675643ed | dataset:07c31ef4-cc72-4348-813a-f074675643ed/subjects/sub-STxM_05 |
| dataset:07c31ef4-cc72-4348-813a-f074675643ed | dataset:07c31ef4-cc72-4348-813a-f074675643ed/subjects/sub-STxM_09 |
| dataset:07c31ef4-cc72-4348-813a-f074675643ed | dataset:07c31ef4-cc72-4348-813a-f074675643ed/subjects/sub-STxM_14 |
| dataset:07c31ef4-cc72-4348-813a-f074675643ed | dataset:07c31ef4-cc72-4348-813a-f074675643ed/subjects/sub-STxM_15 |
| dataset:07c31ef4-cc72-4348-813a-f074675643ed | dataset:07c31ef4-cc72-4348-813a-f074675643ed/subjects/sub-STxM_16 |
| dataset:07c31ef4-cc72-4348-813a-f074675643ed | dataset:07c31ef4-cc72-4348-813a-f074675643ed/subjects/sub-STxM_18 |
| dataset:07c31ef4-cc72-4348-813a-f074675643ed | dataset:07c31ef4-cc72-4348-813a-f074675643ed/subjects/sub-STxM_19 |

**** Dataset groups
#+name: dataset-groups
#+begin_src sparql
SELECT DISTINCT
?dataset
?group
?subj
WHERE {
    ?startsubj TEMP:hasDerivedInformationAsParticipant ?dataset .
    ?subj  TEMP:hasDerivedInformationAsParticipant ?dataset .
    ?subj  TEMP:hasAssignedGroup ?group .
} LIMIT ?limit
#+end_src

#+call: dataset-groups(startsubj="<https://api.pennsieve.io/datasets/N:dataset:07c31ef4-cc72-4348-813a-f074675643ed/subjects/sub-STxF_19>", limit="100")

#+RESULTS:
| dataset                                      | group                | subj                                                              |
|----------------------------------------------+----------------------+-------------------------------------------------------------------|
| dataset:07c31ef4-cc72-4348-813a-f074675643ed | Intact female L6     | dataset:07c31ef4-cc72-4348-813a-f074675643ed/subjects/sub-IF_01   |
| dataset:07c31ef4-cc72-4348-813a-f074675643ed | Intact female L6     | dataset:07c31ef4-cc72-4348-813a-f074675643ed/subjects/sub-IF_03   |
| dataset:07c31ef4-cc72-4348-813a-f074675643ed | Intact female L6     | dataset:07c31ef4-cc72-4348-813a-f074675643ed/subjects/sub-IF_04   |
| dataset:07c31ef4-cc72-4348-813a-f074675643ed | Intact female L6     | dataset:07c31ef4-cc72-4348-813a-f074675643ed/subjects/sub-IF_06   |
| dataset:07c31ef4-cc72-4348-813a-f074675643ed | Intact female L6     | dataset:07c31ef4-cc72-4348-813a-f074675643ed/subjects/sub-IF_07   |
| dataset:07c31ef4-cc72-4348-813a-f074675643ed | Intact female L6     | dataset:07c31ef4-cc72-4348-813a-f074675643ed/subjects/sub-IF_08   |
| dataset:07c31ef4-cc72-4348-813a-f074675643ed | Intact female L6     | dataset:07c31ef4-cc72-4348-813a-f074675643ed/subjects/sub-IF_09   |
| dataset:07c31ef4-cc72-4348-813a-f074675643ed | Intact female L6     | dataset:07c31ef4-cc72-4348-813a-f074675643ed/subjects/sub-IF_10   |
| dataset:07c31ef4-cc72-4348-813a-f074675643ed | Intact female L6     | dataset:07c31ef4-cc72-4348-813a-f074675643ed/subjects/sub-IF_11   |
| dataset:07c31ef4-cc72-4348-813a-f074675643ed | Intact female L6     | dataset:07c31ef4-cc72-4348-813a-f074675643ed/subjects/sub-IF_12   |
| dataset:07c31ef4-cc72-4348-813a-f074675643ed | Intact male L6       | dataset:07c31ef4-cc72-4348-813a-f074675643ed/subjects/sub-IM_07   |
| dataset:07c31ef4-cc72-4348-813a-f074675643ed | Intact male L6       | dataset:07c31ef4-cc72-4348-813a-f074675643ed/subjects/sub-IM_08   |
| dataset:07c31ef4-cc72-4348-813a-f074675643ed | Intact male L6       | dataset:07c31ef4-cc72-4348-813a-f074675643ed/subjects/sub-IM_11   |
| dataset:07c31ef4-cc72-4348-813a-f074675643ed | Intact male L6       | dataset:07c31ef4-cc72-4348-813a-f074675643ed/subjects/sub-IM_13   |
| dataset:07c31ef4-cc72-4348-813a-f074675643ed | Intact male L6       | dataset:07c31ef4-cc72-4348-813a-f074675643ed/subjects/sub-IM_14   |
| dataset:07c31ef4-cc72-4348-813a-f074675643ed | Intact male L6       | dataset:07c31ef4-cc72-4348-813a-f074675643ed/subjects/sub-IM_15   |
| dataset:07c31ef4-cc72-4348-813a-f074675643ed | Intact male L6       | dataset:07c31ef4-cc72-4348-813a-f074675643ed/subjects/sub-IM_16   |
| dataset:07c31ef4-cc72-4348-813a-f074675643ed | Transected female L6 | dataset:07c31ef4-cc72-4348-813a-f074675643ed/subjects/sub-STxF_02 |
| dataset:07c31ef4-cc72-4348-813a-f074675643ed | Transected female L6 | dataset:07c31ef4-cc72-4348-813a-f074675643ed/subjects/sub-STxF_04 |
| dataset:07c31ef4-cc72-4348-813a-f074675643ed | Transected female L6 | dataset:07c31ef4-cc72-4348-813a-f074675643ed/subjects/sub-STxF_10 |
| dataset:07c31ef4-cc72-4348-813a-f074675643ed | Transected female L6 | dataset:07c31ef4-cc72-4348-813a-f074675643ed/subjects/sub-STxF_11 |
| dataset:07c31ef4-cc72-4348-813a-f074675643ed | Transected female L6 | dataset:07c31ef4-cc72-4348-813a-f074675643ed/subjects/sub-STxF_12 |
| dataset:07c31ef4-cc72-4348-813a-f074675643ed | Transected female L6 | dataset:07c31ef4-cc72-4348-813a-f074675643ed/subjects/sub-STxF_13 |
| dataset:07c31ef4-cc72-4348-813a-f074675643ed | Transected female L6 | dataset:07c31ef4-cc72-4348-813a-f074675643ed/subjects/sub-STxF_15 |
| dataset:07c31ef4-cc72-4348-813a-f074675643ed | Transected female L6 | dataset:07c31ef4-cc72-4348-813a-f074675643ed/subjects/sub-STxF_17 |
| dataset:07c31ef4-cc72-4348-813a-f074675643ed | Transected female L6 | dataset:07c31ef4-cc72-4348-813a-f074675643ed/subjects/sub-STxF_18 |
| dataset:07c31ef4-cc72-4348-813a-f074675643ed | Transected female L6 | dataset:07c31ef4-cc72-4348-813a-f074675643ed/subjects/sub-STxF_19 |
| dataset:07c31ef4-cc72-4348-813a-f074675643ed | Transected male L6   | dataset:07c31ef4-cc72-4348-813a-f074675643ed/subjects/sub-STxM_02 |
| dataset:07c31ef4-cc72-4348-813a-f074675643ed | Transected male L6   | dataset:07c31ef4-cc72-4348-813a-f074675643ed/subjects/sub-STxM_05 |
| dataset:07c31ef4-cc72-4348-813a-f074675643ed | Transected male L6   | dataset:07c31ef4-cc72-4348-813a-f074675643ed/subjects/sub-STxM_09 |
| dataset:07c31ef4-cc72-4348-813a-f074675643ed | Transected male L6   | dataset:07c31ef4-cc72-4348-813a-f074675643ed/subjects/sub-STxM_14 |
| dataset:07c31ef4-cc72-4348-813a-f074675643ed | Transected male L6   | dataset:07c31ef4-cc72-4348-813a-f074675643ed/subjects/sub-STxM_15 |
| dataset:07c31ef4-cc72-4348-813a-f074675643ed | Transected male L6   | dataset:07c31ef4-cc72-4348-813a-f074675643ed/subjects/sub-STxM_16 |
| dataset:07c31ef4-cc72-4348-813a-f074675643ed | Transected male L6   | dataset:07c31ef4-cc72-4348-813a-f074675643ed/subjects/sub-STxM_18 |
| dataset:07c31ef4-cc72-4348-813a-f074675643ed | Transected male L6   | dataset:07c31ef4-cc72-4348-813a-f074675643ed/subjects/sub-STxM_19 |

**** Dataset bundle
#+name: dataset-bundle
#+begin_src sparql
SELECT DISTINCT
?dataset
WHERE {
    ?startdataset TEMP:collectionTitle ?string .
    ?dataset  TEMP:collectionTitle ?string .
}
LIMIT ?limit
#+end_src

#+call: dataset-bundle(startdataset="dataset:bec4d335-9377-4863-9017-ecd01170f354")

#+RESULTS:
| dataset                                      |
|----------------------------------------------|
| dataset:6c059ef7-f94a-40af-ab5a-50f482737fc1 |
| dataset:6d6818f2-ef75-4be5-9360-8d37661a8463 |
| dataset:6fa2666c-aa3d-4e27-a405-7848fc061b04 |
| dataset:be6c03c9-e427-488a-9dea-f4f64fca1f14 |
| dataset:bec4d335-9377-4863-9017-ecd01170f354 |

**** Dataset subject species
#+begin_src sparql :var limit="100"
SELECT DISTINCT
?dataset
?species
WHERE {
    #VALUES ?species { "human" "homo sapiens" "homo sapien (human)" } .
    ?dataset TEMP:isAboutParticipant ?subject .
    ?subject sparc:animalSubjectIsOfSpecies ?species .
    FILTER ( CONTAINS(str(?species), "human") || CONTAINS(str(?species), "homo sapiens") || ?species = NCBITaxon:9606 )
}
LIMIT ?limit
#+end_src

#+RESULTS:
| dataset                                      | species             |
|----------------------------------------------+---------------------|
| dataset:3b28ba19-e7ca-4ee2-be69-34029c31060a | homo sapien (human) |
| dataset:5e8be903-8796-408b-a404-8cf6bdca5cec | homo sapien (human) |
| dataset:b0c104b4-f448-4a33-9adb-33704a1890f8 | homo sapien (human) |
| dataset:194f0c6e-cfd5-4a40-9904-713c14111f80 | NCBITaxon:9606      |
| dataset:217920c9-08cc-4680-99ff-d321b0484098 | NCBITaxon:9606      |
| dataset:55c5b69c-a5b8-4881-a105-e4048af26fa5 | NCBITaxon:9606      |
| dataset:57466879-2cdd-4af2-8bd6-7d867423c709 | NCBITaxon:9606      |
| dataset:6d6818f2-ef75-4be5-9360-8d37661a8463 | NCBITaxon:9606      |
| dataset:6f657e63-735b-4ef0-9f31-06b8c2077703 | NCBITaxon:9606      |
| dataset:7a338939-fd82-4dbe-a1c0-3c0632fdd7ef | NCBITaxon:9606      |
| dataset:7d3aed89-ca43-41f5-9f21-e4bbce0d5888 | NCBITaxon:9606      |
| dataset:03dd0308-c7c0-47ab-b9ae-03042723b1ce | NCBITaxon:9606      |
| dataset:093c54b7-34c3-4204-9cea-0e2bdfd1fa93 | NCBITaxon:9606      |
| dataset:0e0a90b4-275f-40d9-b214-b84071bc0456 | NCBITaxon:9606      |
| dataset:a698310c-6310-4de4-83be-39e2f539581c | NCBITaxon:9606      |
| dataset:aec9ab8f-3c7f-4dd2-a638-466a6fb57f96 | NCBITaxon:9606      |
| dataset:c34c5b05-4934-4a17-953c-069adf3aec46 | NCBITaxon:9606      |

**** Dataset milestone completion date
#+begin_src sparql
SELECT DISTINCT
?dataset
?date
WHERE {
    ?dataset TEMP:milestoneCompletionDate ?date .
}
ORDER BY ASC(?date)
LIMIT ?limit
#+end_src

#+RESULTS:
| dataset                                      |                   date |
|----------------------------------------------+------------------------|
| dataset:1da4fa02-b7e1-4fb3-8cd1-f27d489f2ed8 |             04/31/2019 |
| dataset:8912fa28-8f9c-4851-8de8-bc0c788bf67b |          2019 - 12- 31 |
| dataset:f88a25e8-dcb8-487e-9f2d-930b4d3abded |             2019-01-15 |
| dataset:83fdbd3f-6028-4276-b2f0-bc6691b0d3cb | 2019-05-31, 2019-11-30 |
| dataset:59e64463-8bff-481a-8318-6230518ee487 |             2019-06-06 |
| dataset:f6dd731f-fa13-4dcd-af8f-00da5cc5855b |             2019-06-11 |
| dataset:fc6e3a87-1241-4f81-b284-8ebc82efc499 |             2019-06-30 |
| dataset:ae5ee3dc-1766-4c0d-a18f-c6ea2bb367c0 |             2019-11-30 |
| dataset:ed9a0da6-8dc1-49d4-8df1-cd528097a6a2 |             2020-02-15 |
| dataset:e2c90515-bbdb-4436-a48c-aafaefb604e6 |             2020-02-28 |

**** Award affiliations
#+begin_src sparql
SELECT DISTINCT
?award
?affiliation
(str(?affil_l) as ?al)
WHERE {
    ?dataset TEMP:hasAwardNumber ?award .
    ?contributor TEMP:contributorTo ?dataset .
    ?contributor TEMP:hasAffiliation ?affiliation .
    ?affiliation rdfs:label ?affil_l .
    # FILTER isUri(?affiliation)
}
ORDER BY ASC(?award) ASC(?al)
LIMIT ?limit
#+end_src

#+RESULTS:
| award                              | affiliation   | al                                                |
|------------------------------------+---------------+---------------------------------------------------|
| awards:AOD18017                    | ror:046rm7j60 | University of California, Los Angeles             |
| awards:NIH/FDAIAA:AOD1801700100000 | ror:002pd6e78 | Massachusetts General Hospital                    |
| awards:OT20D024912                 | ror:04a9tmd77 | Icahn School of Medicine at Mount Sinai           |
| awards:OT20D24912                  | ror:04a9tmd77 | Icahn School of Medicine at Mount Sinai           |
| awards:OT2OD023847                 | ror:05ht4p406 | Indiana University School of Medicine - Lafayette |
| awards:OT2OD023847                 | ror:02dqehb95 | Purdue University West Lafayette                  |
| awards:OT2OD023847                 | ror:00ysqcn41 | Thomas Jefferson University                       |
| awards:OT2OD023847                 | ror:01ej9dk98 | University of Melbourne                           |
| awards:OT2OD023847                 | ror:04402f517 | University of Nevada, Reno School of Medicine     |
| awards:OT2OD023848                 | ror:05a0ya142 | Broad Institute                                   |

** Experimental Protocol
*** Conditions studied
*** Experimental groups
#+name: experimental-groups-core
#+begin_src sparql :var limit="10"
WHERE {
    ?startsubj TEMP:hasDerivedInformationAsParticipant ?dataset .
    ?subj  TEMP:hasDerivedInformationAsParticipant ?dataset .
    ?subj  TEMP:hasAssignedGroup ?group .
}
#+end_src

#+name: experimental-groups
#+begin_src sparql :var limit="10" :noweb yes
SELECT DISTINCT
?dataset
?group
?subj
<<experimental-groups-core>>
ORDER BY ASC(?dataset) ASC(?group) LIMIT ?limit
#+end_src

#+RESULTS: experimental-groups
| dataset                                      | group | subj                                                           |
|----------------------------------------------+-------+----------------------------------------------------------------|
| dataset:01b5cc2d-b321-4fed-8767-52771c4d680f |     0 | dataset:01b5cc2d-b321-4fed-8767-52771c4d680f/subjects/sub17064 |
| dataset:01b5cc2d-b321-4fed-8767-52771c4d680f |     0 | dataset:01b5cc2d-b321-4fed-8767-52771c4d680f/subjects/sub17065 |
| dataset:01b5cc2d-b321-4fed-8767-52771c4d680f |     0 | dataset:01b5cc2d-b321-4fed-8767-52771c4d680f/subjects/sub17066 |
| dataset:01b5cc2d-b321-4fed-8767-52771c4d680f |     0 | dataset:01b5cc2d-b321-4fed-8767-52771c4d680f/subjects/sub16013 |
| dataset:01b5cc2d-b321-4fed-8767-52771c4d680f |     0 | dataset:01b5cc2d-b321-4fed-8767-52771c4d680f/subjects/sub16014 |
| dataset:01b5cc2d-b321-4fed-8767-52771c4d680f |     0 | dataset:01b5cc2d-b321-4fed-8767-52771c4d680f/subjects/sub16015 |
| dataset:01b5cc2d-b321-4fed-8767-52771c4d680f |     0 | dataset:01b5cc2d-b321-4fed-8767-52771c4d680f/subjects/sub16016 |
| dataset:01b5cc2d-b321-4fed-8767-52771c4d680f |     0 | dataset:01b5cc2d-b321-4fed-8767-52771c4d680f/subjects/sub16017 |
| dataset:01b5cc2d-b321-4fed-8767-52771c4d680f |     0 | dataset:01b5cc2d-b321-4fed-8767-52771c4d680f/subjects/sub17018 |
| dataset:01b5cc2d-b321-4fed-8767-52771c4d680f |     0 | dataset:01b5cc2d-b321-4fed-8767-52771c4d680f/subjects/sub17020 |

#+name: experimental-groups-by-dataset
#+begin_src sparql :noweb yes :var limit="10"
SELECT DISTINCT
?group
?subj
<<experimental-groups-core>>
ORDER BY ASC(?group) LIMIT ?limit
#+end_src

#+RESULTS: experimental-groups-by-dataset
| group                                                                               | subj                                                                                              |
|-------------------------------------------------------------------------------------+---------------------------------------------------------------------------------------------------|
| (verify the effects of Actinomycin D (ActD) application on transcriptional changes) | dataset:91b1cfca-05e9-4445-bac8-04bf7a4593f1/samples/sub-20190807P_1_ActD_sam-20190807P_1_pC_ActD |
| 0 mA                                                                                | dataset:257a485a-89b3-4187-888a-9843b277e6cb/samples/sub-D6616_sam-D6616%20LA                     |
| 0 mA                                                                                | dataset:257a485a-89b3-4187-888a-9843b277e6cb/samples/sub-D6616_sam-D6616%20LV                     |
| 0 mA                                                                                | dataset:257a485a-89b3-4187-888a-9843b277e6cb/samples/sub-D6616_sam-D6616%20RA                     |
| 0 mA                                                                                | dataset:257a485a-89b3-4187-888a-9843b277e6cb/samples/sub-D6616_sam-D6616%20RV                     |
| 0 mA                                                                                | dataset:257a485a-89b3-4187-888a-9843b277e6cb/samples/sub-D6845_sam-D6845%20LA                     |
| 0 mA                                                                                | dataset:257a485a-89b3-4187-888a-9843b277e6cb/samples/sub-D6845_sam-D6845%20LV                     |
| 0 mA                                                                                | dataset:257a485a-89b3-4187-888a-9843b277e6cb/samples/sub-D6845_sam-D6845%20RA                     |
| 0 mA                                                                                | dataset:257a485a-89b3-4187-888a-9843b277e6cb/samples/sub-D6845_sam-D6845%20RV                     |
| 0 mA                                                                                | dataset:257a485a-89b3-4187-888a-9843b277e6cb/samples/sub-D6863_sam-D6863%20LA                     |

# #+call: experimental-groups-by-dataset(limit="20",dataset="dataset:01b5cc2d-b321-4fed-8767-52771c4d680f")
# FIXME this is broken
#+call: experimental-groups-by-dataset(limit="20", dataset="dataset:257a485a-89b3-4187-888a-9843b277e6cb")

#+RESULTS:
| group | subj                                                                                               |
|-------+----------------------------------------------------------------------------------------------------|
|     0 | https://api.pennsieve.io/datasets/N:dataset:01b5cc2d-b321-4fed-8767-52771c4d680f/subjects/sub17067 |
|     0 | https://api.pennsieve.io/datasets/N:dataset:01b5cc2d-b321-4fed-8767-52771c4d680f/subjects/sub17068 |
|     0 | https://api.pennsieve.io/datasets/N:dataset:01b5cc2d-b321-4fed-8767-52771c4d680f/subjects/sub17074 |
|     0 | https://api.pennsieve.io/datasets/N:dataset:01b5cc2d-b321-4fed-8767-52771c4d680f/subjects/sub17075 |
|     0 | https://api.pennsieve.io/datasets/N:dataset:01b5cc2d-b321-4fed-8767-52771c4d680f/subjects/sub17077 |
|     0 | https://api.pennsieve.io/datasets/N:dataset:01b5cc2d-b321-4fed-8767-52771c4d680f/subjects/sub17078 |
|     0 | https://api.pennsieve.io/datasets/N:dataset:01b5cc2d-b321-4fed-8767-52771c4d680f/subjects/sub17079 |
|     0 | https://api.pennsieve.io/datasets/N:dataset:01b5cc2d-b321-4fed-8767-52771c4d680f/subjects/sub17080 |
|     0 | https://api.pennsieve.io/datasets/N:dataset:01b5cc2d-b321-4fed-8767-52771c4d680f/subjects/sub17083 |
|     0 | https://api.pennsieve.io/datasets/N:dataset:01b5cc2d-b321-4fed-8767-52771c4d680f/subjects/sub17084 |
|     0 | https://api.pennsieve.io/datasets/N:dataset:01b5cc2d-b321-4fed-8767-52771c4d680f/subjects/sub17099 |
|     0 | https://api.pennsieve.io/datasets/N:dataset:01b5cc2d-b321-4fed-8767-52771c4d680f/subjects/sub17113 |
|     0 | https://api.pennsieve.io/datasets/N:dataset:01b5cc2d-b321-4fed-8767-52771c4d680f/subjects/sub17114 |
|     0 | https://api.pennsieve.io/datasets/N:dataset:01b5cc2d-b321-4fed-8767-52771c4d680f/subjects/sub17140 |
|     0 | https://api.pennsieve.io/datasets/N:dataset:01b5cc2d-b321-4fed-8767-52771c4d680f/subjects/sub17154 |
|     0 | https://api.pennsieve.io/datasets/N:dataset:01b5cc2d-b321-4fed-8767-52771c4d680f/subjects/sub17172 |
|     0 | https://api.pennsieve.io/datasets/N:dataset:01b5cc2d-b321-4fed-8767-52771c4d680f/subjects/sub17173 |
|     0 | https://api.pennsieve.io/datasets/N:dataset:01b5cc2d-b321-4fed-8767-52771c4d680f/subjects/sub16013 |
|     0 | https://api.pennsieve.io/datasets/N:dataset:01b5cc2d-b321-4fed-8767-52771c4d680f/subjects/sub16014 |
|     0 | https://api.pennsieve.io/datasets/N:dataset:01b5cc2d-b321-4fed-8767-52771c4d680f/subjects/sub16015 |

*** Techniques
# #+header: :var dataset=(identity nil)
#+begin_src sparql
SELECT DISTINCT
?dataset
?technique
# ?protocol
# ?technique_p
WHERE {
  { ?dataset a sparc:Dataset .
    ?dataset TEMP:protocolEmploysTechnique ?technique .
    # ?technique rdfs:label ?tl
  }
  UNION
  { ?dataset TEMP:hasProtocol ?protocol .
    ?protocol TEMP:protocolEmploysTechnique ?technique .
    # ?technique rdfs:label ?tl
  }
}
LIMIT ?limit
#+end_src

#+RESULTS:
| dataset                                      | technique        |
|----------------------------------------------+------------------|
| dataset:bdef79e4-ec07-409e-9237-afc7656f55f9 | tech:libraryPrep |
| dataset:d4ca262e-7893-4d72-9325-03dd08b053ce | tech:dissection  |
| dataset:2d0a2996-be8a-441d-816c-adfe3577fc7d | tech:dissection  |
| dataset:ff6eb067-62d4-4bfb-b4b2-15ad65db0999 | tech:dissection  |
| dataset:ff6eb067-62d4-4bfb-b4b2-15ad65db0999 | tech:imaging     |
| dataset:0e0a90b4-275f-40d9-b214-b84071bc0456 | tech:imaging     |
| dataset:02786240-2033-4f86-808d-daf345ce3165 | NLXINV:20090607  |
| dataset:6314677c-7dfd-41ff-96c8-2dd178207a84 | NLXINV:20090607  |
| dataset:a6c6803a-3a2e-4c69-9a94-3527083f13dc | NLXINV:20090607  |
| dataset:30237b91-610d-4d73-944b-5d7687508743 | tech:statistics  |

*** Test
**** Protocol techniques
#+begin_src sparql
SELECT DISTINCT
?protocol
?technique
WHERE {
    ?protocol rdf:type sparc:Protocol .
    ?protocol TEMP:protocolEmploysTechnique ?technique .
}
LIMIT ?limit
#+end_src

#+RESULTS:
| protocol                                  | technique        |
|-------------------------------------------+------------------|
| https://journals.plos.org/plosone/article | tech:measuring   |
| https://journals.plos.org/plosone/article | tech:sigproc     |
| pio.api:18394                             | tech:libraryPrep |
| pio.api:18663                             | tech:surgical    |
| pio.api:18980                             | tech:surgical    |
| pio.api:18980                             | BIRNLEX:2135     |
| pio.api:18985                             | tech:statistics  |
| pio.api:18985                             | tech:surgical    |
| pio.api:18994                             | tech:dissection  |
| pio.api:19088                             | tech:dissection  |

**** Protocol aspects
#+begin_src sparql
SELECT DISTINCT
?protocol
?aspect
WHERE {
    ?protocol rdf:type sparc:Protocol .
    ?protocol TEMP:protocolInvolvesAspect ?ast .
    ?ast rdf:type protcur:aspect .
    ?ast TEMP:hasValue ?aspect .
}
LIMIT ?limit
#+end_src

#+RESULTS:
| protocol      | aspect          |
|---------------+-----------------|
| pio.api:18578 | PATO:0000033    |
| pio.api:18578 | PATO:0000146    |
| pio.api:18578 | PATO:0000918    |
| pio.api:18578 | PATO:0001309    |
| pio.api:18578 | asp:temperature |
| pio.api:18539 | PATO:0000146    |
| pio.api:18539 | asp:acidity     |
| pio.api:18539 | PATO:0001986    |
| pio.api:18539 | PATO:0000918    |
| pio.api:18578 | asp:location    |

**** Protocol inputs
# Note that the ontology alignment here is often incorrect
#+begin_src sparql
SELECT DISTINCT
?protocol
?ast_in
?input
WHERE {
    ?protocol rdf:type sparc:Protocol .
    ?protocol TEMP:protocolInvolvesInput ?ast_in .
    ?ast_in rdf:type protcur:input .
    ?ast_in TEMP:hasValue ?input .
}
LIMIT ?limit
#+end_src

#+RESULTS:
| protocol                                         | ast_in                             | input                                                      |
|--------------------------------------------------+------------------------------------+------------------------------------------------------------|
| https://journals.plos.org/plosone/article        | hyp-protcur:6lXR_IuiEemgDZOF7_cfnQ | http://www.cognitiveatlas.org/ontology/cogat.owl#CAO_00597 |
| https://journals.plos.org/plosone/article        | hyp-protcur:7sKuSovFEemigA9jhMKA-A | UBERON:0000020                                             |
| https://journals.plos.org/plosone/article        | hyp-protcur:8TBOcIcREem_VB9-fOAI0Q | PATO:0001199                                               |
| https://journals.plos.org/plosone/article        | hyp-protcur:bMhpYobsEemuebcALxBaUg | GO:0004235                                                 |
| https://journals.plos.org/plosone/article        | hyp-protcur:dPdc0oZXEemfeb-n9lk0Rw | UBERON:0003148                                             |
| https://www.biorxiv.org/content/10.1101/661033v1 | hyp-protcur:2ucUuowAEeq9npt2H-bQyA | CHEBI:6015                                                 |
| https://www.biorxiv.org/content/10.1101/661033v1 | hyp-protcur:7u4hZIwBEeq45CPjC1qfPw | CHEBI:16236                                                |
| https://www.biorxiv.org/content/10.1101/661033v1 | hyp-protcur:9W2mfIwBEeqfzsvP5y8ZjA | CHEBI:27338                                                |
| https://www.biorxiv.org/content/10.1101/661033v1 | hyp-protcur:C7X1yowBEeq40E_t4SzHlA | CHEBI:17790                                                |
| https://www.biorxiv.org/content/10.1101/661033v1 | hyp-protcur:dQqe4IvoEeqc3LelMIm4iQ | SCR:017322                                                 |

**** Protocol species dose
#+begin_src sparql
SELECT DISTINCT
?dataset
?protocol

?label_drug
?value_lt
WHERE {
    VALUES ?t {protcur:invariant protcur:parameter} .
    ?ast_inv a ?t .
    ?ast_inv TEMP:hasValue ?bnode .
    ?bnode ilxtr:jsonRecordType <https://uilx.org/tgbugs/u/sparcur-protcur-json-ld/quantity> .
    ?bnode rdf:value ?value_lt .
    ?bnode TEMP:hasUnit <https://uilx.org/tgbugs/u/sparcur-protcur-json-ld/milligram%20%2F%20kilogram> .
    FILTER (?value_lt < ?limit)

    ?ast_drug a protcur:input .
    ?ast_drug TEMP:hasValue ?drug .
                            ?drug rdfs:label ?label_drug .
    ?ast_drug TEMP:protcurChildren+ ?ast_child .
    ?ast_child TEMP:hasValue ?bnode .

    ?protocol a sparc:Protocol .
    ?protocol TEMP:protocolInvolvesInput ?ast_drug .

    ?protocol TEMP:protocolInvolvesInput ?ast_in_sp .
    ?ast_in_sp rdf:type protcur:input .
    ?ast_in_sp TEMP:hasValue ?species .

    OPTIONAL { ?dataset TEMP:hasProtocol ?protocol } .

}
ORDER BY ?label_input ?value_lt
#+end_src

#+RESULTS:
| dataset                                      | protocol      | label_drug         | value_lt |
|----------------------------------------------+---------------+--------------------+----------|
| dataset:4a216c79-1eab-451f-b096-5fa44bc00789 | pio.api:19342 | dexmedetomidine    |   3.3E-2 |
|                                              | pio.api:18980 | bolus of food      |   1.0E-1 |
|                                              | pio.api:18980 | bolus of food      |   1.0E-1 |
|                                              | pio.api:18980 | atropine           |   5.4E-1 |
| dataset:277a76fa-7f1e-4a19-9a70-d0729beef331 | pio.api:24077 | midazolam          |        1 |
| dataset:91dab959-7600-4f14-bae3-d1e6ba5c15ae | pio.api:24077 | midazolam          |        1 |
| dataset:98e467ce-7e43-4bbd-8ee7-ab8e2adcc6c0 | pio.api:24077 | midazolam          |        1 |
| dataset:d4ca262e-7893-4d72-9325-03dd08b053ce | pio.api:18994 | bupivacaine        |        2 |
| dataset:3a7ccb46-4320-4409-b359-7f4a7027bb9c | pio.api:23160 | lidocaine          |        2 |
| dataset:d4ca262e-7893-4d72-9325-03dd08b053ce | pio.api:18994 | lidocaine          |        4 |
| dataset:21957eae-0824-4fb5-b18f-04d6ed12ce18 | pio.api:19107 | lipopolysaccharide |        4 |
| dataset:4a216c79-1eab-451f-b096-5fa44bc00789 | pio.api:19342 | ketamine           |    6.6E0 |
| dataset:378d07cf-4b8b-49e8-a069-e96810e68b57 | pio.api:19640 | mixture            |        9 |
| dataset:378d07cf-4b8b-49e8-a069-e96810e68b57 | pio.api:19640 | xylazine           |        9 |
| dataset:fd07322c-ac30-488f-a6db-f5ff52c69e1b | pio.api:20256 | mixture            |        9 |
| dataset:fd07322c-ac30-488f-a6db-f5ff52c69e1b | pio.api:20256 | xylazine           |        9 |

** Datasets following same protocol with different subjects
*** Completeness
#+begin_src sparql
SELECT DISTINCT
?dataset
?completeness
WHERE {
  ?dataset a sparc:Dataset .
  ?dataset TEMP:completenessOfDataset ?completeness .
}
LIMIT ?limit
#+end_src

#+RESULTS:
| dataset                                      | completeness         |
|----------------------------------------------+----------------------|
| dataset:0426ab91-194d-431d-acf7-f9dfad26e295 | hasNEXT              |
| dataset:3b28ba19-e7ca-4ee2-be69-34029c31060a | Yes                  |
| dataset:88d3bbc6-014e-4ba3-a5ca-b27eddccfcc7 | hasNext, hasChildren |
| dataset:91b1cfca-05e9-4445-bac8-04bf7a4593f1 | hasNEXT              |
| dataset:a9b14217-9084-4fd8-ae0a-5e801e708e86 | part, Q4 yr 2        |
| dataset:ac2279ba-b8b0-4214-98af-437111a2ae61 | Ongoing study        |
| dataset:bfa288a0-1f6e-482f-858e-9529baa50b0f | On going             |
| dataset:c0b435a5-15d9-4cc8-9eb9-3c4a00626690 | hasNext, hasChildren |
| dataset:d484110a-e6e3-4574-aab2-418703c978e2 | hasNext              |
| dataset:dae2fef9-05e6-418f-8374-3af267643340 | hasNext              |
*** Dataset collections
#+begin_src sparql
SELECT DISTINCT
?title
?dataset
WHERE {
    ?startdataset TEMP:collectionTitle ?title .
    ?dataset  TEMP:collectionTitle ?title .
}
ORDER BY ASC(?title)
LIMIT ?limit
#+end_src

#+RESULTS:
| title                                                                                                                                   | dataset                                      |
|-----------------------------------------------------------------------------------------------------------------------------------------+----------------------------------------------|
| A multi-scale model of cardiac electrophysiology                                                                                        | dataset:c5c2f40f-76be-4979-bfc4-b9f9947231cf |
| AAV Serotypes 6_8_9 Intrapancreatic 4 weeks                                                                                             | dataset:fce3f57f-18ea-4453-887e-58a885e90e7e |
| AAV8 Titer and Route                                                                                                                    | dataset:458d3e2c-8f75-4298-bf10-8322b058b148 |
| AAV8 Titer and Route                                                                                                                    | dataset:b4e7758e-9a8f-4806-9bb0-1d5e7098df6a |
| AAVretro Serotype Intrapancreatic 4 weeks                                                                                               | dataset:43da251b-59bd-43fa-8a8a-3a0276da968f |
| Acute Effects of Efferent/Afferent Vagus Nerve Stimulation (VNS) on neural activity accessed with functional Magnetic Resonance Imaging | dataset:99592359-0c48-4b0c-ab3d-b8b1b79bb7bf |
| Acute Effects of Gastric Electrical Stimulation (GES) Settings on neural activity accessed with functional Magnetic Resonance Imaging   | dataset:2f4afec4-6e4d-4c20-b913-8e115fc8631b |
| Acute Effects of Vagus Nerve Stimulation (VNS) Settings on neural activity in the nucleus of solitary tract (NTS)                       | dataset:e25a096b-7180-471a-847d-4aa711113d54 |
| Acute Effects of efferent/afferent Vagus Nerve Stimulation (VNS) on neural activity accessed with functional Magnetic Resonance Imaging | dataset:70f8888b-0b9e-4e9d-93ca-2103e8828512 |
| Acute effects of gastric electrical stimulation settings on gastric motility assessed with MRI                                          | dataset:c2564991-28d5-42cf-bfb6-8f93b874a5af |

** Subjects
*** Members
#+begin_src sparql
SELECT DISTINCT
?dataset
?subject
WHERE {
  ?dataset a sparc:Dataset .
  ?dataset TEMP:isAboutParticipant ?subject .
  ?subject a sparc:Subject .
}
LIMIT ?limit
#+end_src

#+RESULTS:
| dataset                                      | subject                                                        |
|----------------------------------------------+----------------------------------------------------------------|
| dataset:6a280dc2-1d0b-434f-8387-3c8e3615c649 | dataset:6a280dc2-1d0b-434f-8387-3c8e3615c649/subjects/11050    |
| dataset:6a280dc2-1d0b-434f-8387-3c8e3615c649 | dataset:6a280dc2-1d0b-434f-8387-3c8e3615c649/subjects/11051    |
| dataset:6a280dc2-1d0b-434f-8387-3c8e3615c649 | dataset:6a280dc2-1d0b-434f-8387-3c8e3615c649/subjects/11052    |
| dataset:6a280dc2-1d0b-434f-8387-3c8e3615c649 | dataset:6a280dc2-1d0b-434f-8387-3c8e3615c649/subjects/11053    |
| dataset:6b29ddff-86fc-4dc3-bb78-8e572a788a85 | dataset:6b29ddff-86fc-4dc3-bb78-8e572a788a85/subjects/sub-cat5 |
| dataset:6c059ef7-f94a-40af-ab5a-50f482737fc1 | dataset:6c059ef7-f94a-40af-ab5a-50f482737fc1/subjects/sub-10   |
| dataset:6c059ef7-f94a-40af-ab5a-50f482737fc1 | dataset:6c059ef7-f94a-40af-ab5a-50f482737fc1/subjects/sub-11   |
| dataset:6c059ef7-f94a-40af-ab5a-50f482737fc1 | dataset:6c059ef7-f94a-40af-ab5a-50f482737fc1/subjects/sub-12   |
| dataset:6c059ef7-f94a-40af-ab5a-50f482737fc1 | dataset:6c059ef7-f94a-40af-ab5a-50f482737fc1/subjects/sub-13   |
| dataset:6c059ef7-f94a-40af-ab5a-50f482737fc1 | dataset:6c059ef7-f94a-40af-ab5a-50f482737fc1/subjects/sub-14   |

*** Total
#+begin_src sparql
SELECT DISTINCT
(COUNT(DISTINCT ?subject) as ?count_subject)
WHERE {
  ?dataset a sparc:Dataset .
  ?dataset TEMP:isAboutParticipant ?subject .
  ?subject a sparc:Subject .
}
#+end_src

#+RESULTS:
| count_subject |
|---------------|
|          2271 |

*** Subject Metadata
- Identifier
- Group
- Species
- Strain
- Sex
- Age Category
- Age
- Mass

# #+header: :var species="NCBITaxon:10116"
# #+header: :var species="NCBITaxon:9685"
#+name: subject-metadata
#+begin_src sparql
SELECT DISTINCT
?local_id

?assigned_group

?l_species
?strain
?l_sex

?age_category
?age_value
?age_unit

?mass_value
?mass_unit

WHERE {
  ?subject a sparc:Subject .
  ?subject TEMP:localId ?local_id .
  ?subject sparc:animalSubjectIsOfSpecies ?species . OPTIONAL { ?species rdfs:label ?l_species . }
  OPTIONAL { ?subject sparc:animalSubjectIsOfStrain ?strain . } # ?strain rdfs:label ?l_strain .
  OPTIONAL { ?subject TEMP:hasBiologicalSex ?sex . ?sex rdfs:label ?l_sex . }
  OPTIONAL { ?subject TEMP:hasAgeCategory ?age_category . }
  OPTIONAL { ?subject TEMP:hasAssignedGroup ?assigned_group . }
  # OPTIONAL { ?subject TEMP:participantInPerformanceOf ?protocol . }

  OPTIONAL {
  # mass
  ?subject sparc:animalSubjectHasWeight ?bn_mass .
  ?bn_mass a sparc:Measurement .
  ?bn_mass TEMP:hasUnit ?mass_unit .
  ?bn_mass rdf:value ?mass_value .
}
  OPTIONAL {
  # age
  ?subject TEMP:hasAge ?bn_age .
  ?bn_age a sparc:Measurement .
  ?bn_age TEMP:hasUnit ?age_unit .
  ?bn_age rdf:value ?age_value .
}
#  VALUES ?l_s {?species ?sex}  # doesn't work, if it did it would duplicate rows
#  ?l_s rdfs:label ?label
} LIMIT ?limit
#+end_src

#+RESULTS: subject-metadata
| local_id                | assigned_group | l_species    | strain   | l_sex | age_category      | age_value | age_unit           | mass_value | mass_unit |
|-------------------------+----------------+--------------+----------+-------+-------------------+-----------+--------------------+------------+-----------|
| sub-nNOS_Male_Subject_1 | nNOS-ChR2      | Mus musculus | C57BL/6  |       | prime adult stage |        84 | unit:dimensionless |            |           |
| sub-nNOS_Male_Subject_2 | nNOS-ChR2      | Mus musculus | C57BL/6  |       | prime adult stage |        84 | unit:dimensionless |            |           |
| sub-nNOS_Male_Subject_3 | nNOS-ChR2      | Mus musculus | C57BL/6  |       | prime adult stage |        56 | unit:dimensionless |            |           |
| sub-C57 061801          | Cleared 1mm    | Mus musculus | C57/Bl6J |       |                   |         4 | unit:week          |            |           |
| sub-C57 061802          | Cleared 1mm    | Mus musculus | C57/Bl6J |       |                   |         4 | unit:week          |            |           |
| sub-C57 061803          | Cleared 1mm    | Mus musculus | C57/Bl6J |       |                   |         4 | unit:week          |            |           |
| sub-C57 061804          | Cleared 1mm    | Mus musculus | C57/Bl6J |       |                   |         4 | unit:week          |            |           |
| sub-C57 071019 01       | WT 150um       | Mus musculus | C57/Bl6J |       |                   |        18 | unit:week          |            |           |
| sub-C57 071019 02       | WT 150um       | Mus musculus | C57/Bl6J |       |                   |        18 | unit:week          |            |           |
| sub-C57 071019 03       | WT 150um       | Mus musculus | C57/Bl6J |       |                   |        18 | unit:week          |            |           |

#+call: subject-metadata() :var species="NCBITaxon:10090"

#+RESULTS:
| local_id                              | assigned_group                                                                                                        | l_species    | strain    | l_sex | age_category      | age_value | age_unit           | mass_value | mass_unit |
|---------------------------------------+-----------------------------------------------------------------------------------------------------------------------+--------------+-----------+-------+-------------------+-----------+--------------------+------------+-----------|
| nNOS Male Subject 2                   | nNOS-NpHR                                                                                                             | Mus musculus | C57/bl6   |       | prime adult stage |        56 | unit:dimensionless |            |           |
| nNOS Male Subject 3                   | nNOS-NpHR                                                                                                             | Mus musculus | C57/bl6   |       | prime adult stage |        56 | unit:dimensionless |            |           |
| AV8-NSE-IP-1                          | AAV Serotypes 6_8_9 intrapancreatic injection                                                                         | Mus musculus | C57BL/6J  |       | Adult             |         3 | unit:month         |            |           |
| AV8-NSE-IP-2                          | AAV Serotypes 6_8_9 intrapancreatic injection                                                                         | Mus musculus | C57BL/6J  |       | Adult             |         3 | unit:month         |            |           |
| AV8-NSE-IP-3                          | AAV Serotypes 6_8_9 intrapancreatic injection                                                                         | Mus musculus | C57BL/6J  |       | Adult             |         3 | unit:month         |            |           |
| AV8-NSE-IP-4                          | AAV Serotypes 6_8_9 intrapancreatic injection                                                                         | Mus musculus | C57BL/6J  |       | Adult             |         3 | unit:month         |            |           |
| AV8-NSE-IP-5                          | AAV Serotypes 6_8_9 intrapancreatic injection                                                                         | Mus musculus | C57BL/6J  |       | Adult             |         3 | unit:month         |            |           |
| AV8-NSE-IP-6                          | AAV Serotypes 6_8_9 intrapancreatic injection                                                                         | Mus musculus | C57BL/6J  |       | Adult             |         3 | unit:month         |            |           |
| sub-RZ9-L10EGFP-AAV-cre-mcherry-BAT1  | AAV6-hSyn-mCherry-cre injected in iBAT bilaterally, followed by about 4 week incubation and then 7-day 28°C treatment | Mus musculus | EGFP-L10a |       |                   |        21 | unit:postnatal_day |            |           |
| sub-RZ9-L10EGFP-AAV-cre-mcherry-BAT10 | AAV6-hSyn-mCherry-cre injected in iBAT bilaterally, followed by about 4 week incubation and then 7-day 28°C treatment | Mus musculus | EGFP-L10a |       |                   |        17 | unit:postnatal_day |            |           |

** Samples
*** Members
#+begin_src sparql
SELECT DISTINCT
?dataset
?sample
WHERE {
  ?dataset a sparc:Dataset .
  ?dataset TEMP:isAboutParticipant ?sample .
  ?sample a sparc:Sample .
}
LIMIT ?limit
#+end_src

#+RESULTS:
| dataset                                      | sample                                                                   |
|----------------------------------------------+--------------------------------------------------------------------------|
| dataset:0170271a-8fac-4769-a8f5-2b9520291d03 | dataset:0170271a-8fac-4769-a8f5-2b9520291d03/samples/sub-HB_sam-HB_60A-3 |
| dataset:0170271a-8fac-4769-a8f5-2b9520291d03 | dataset:0170271a-8fac-4769-a8f5-2b9520291d03/samples/sub-HB_sam-HB_60A-4 |
| dataset:0170271a-8fac-4769-a8f5-2b9520291d03 | dataset:0170271a-8fac-4769-a8f5-2b9520291d03/samples/sub-HB_sam-HB_60B-1 |
| dataset:0170271a-8fac-4769-a8f5-2b9520291d03 | dataset:0170271a-8fac-4769-a8f5-2b9520291d03/samples/sub-HB_sam-HB_60B-2 |
| dataset:0170271a-8fac-4769-a8f5-2b9520291d03 | dataset:0170271a-8fac-4769-a8f5-2b9520291d03/samples/sub-HB_sam-HB_60B-3 |
| dataset:0170271a-8fac-4769-a8f5-2b9520291d03 | dataset:0170271a-8fac-4769-a8f5-2b9520291d03/samples/sub-HB_sam-HB_60B-4 |
| dataset:0170271a-8fac-4769-a8f5-2b9520291d03 | dataset:0170271a-8fac-4769-a8f5-2b9520291d03/samples/sub-HB_sam-HB_65A-1 |
| dataset:0170271a-8fac-4769-a8f5-2b9520291d03 | dataset:0170271a-8fac-4769-a8f5-2b9520291d03/samples/sub-HB_sam-HB_70A-1 |
| dataset:0170271a-8fac-4769-a8f5-2b9520291d03 | dataset:0170271a-8fac-4769-a8f5-2b9520291d03/samples/sub-HB_sam-HB_70A-3 |
| dataset:0170271a-8fac-4769-a8f5-2b9520291d03 | dataset:0170271a-8fac-4769-a8f5-2b9520291d03/samples/sub-HB_sam-HB_70A-4 |

*** Total
#+begin_src sparql
SELECT DISTINCT
(COUNT(DISTINCT ?subject) as ?count_subject)
WHERE {
  ?dataset a sparc:Dataset .
  ?dataset TEMP:isAboutParticipant ?subject .
  ?subject a sparc:Sample .
}
#+end_src

#+RESULTS:
| count_subject |
|---------------|
|          7052 |

*** Sample predicates
#+begin_src sparql
SELECT DISTINCT
?p
WHERE {
  ?sample a sparc:Sample .
  ?sample ?p ?o .
}
#+end_src

#+RESULTS:
| p                                         |
|-------------------------------------------|
| TEMP:TODO                                 |
| TEMP:hasDerivedInformationAsParticipant   |
| TEMP:localId                              |
| TEMP:raw/wasExtractedFromAnatomicalRegion |
| TEMP:wasDerivedFromSubject                |
| rdf:type                                  |
| TEMP:participantInPerformanceOf           |
| TEMP:hasAssignedGroup                     |
| TEMP:hasFolderAboutIt                     |
| TEMP:raw/hasDigitalArtifactThatIsAboutIt  |
| TEMP:providerNote                         |
| TEMP:localPerformanceNumber               |

*** Sample Metadata
#+name: sample-metadata
#+begin_src sparql
SELECT DISTINCT
?subject_lid

?local_id

?assigned_group

(str(?anat_ent_src) as ?aess)

WHERE {
  ?sample a sparc:Sample .
  ?sample TEMP:localId ?local_id .

  ?sample TEMP:wasDerivedFromSubject ?subject .
  ?subject TEMP:localId ?subject_lid .
  ?subject a sparc:Subject .

  OPTIONAL { ?sample TEMP:hasAssignedGroup ?assigned_group . }
  OPTIONAL { ?sample TEMPRAW:wasExtractedFromAnatomicalRegion ?anat_ent_src . }
  # OPTIONAL { ?sample TEMP:participantInPerformanceOf ?protocol . }
}
LIMIT ?limit
#+end_src

#+RESULTS: sample-metadata
| subject_lid     | local_id        | assigned_group | aess                           |
|-----------------+-----------------+----------------+--------------------------------|
| 62_F_14121963   | 62_F_14121963   |                | descending colon               |
| 63_F_30051973   | 63_F_30051973   |                | sigmoid colon                  |
| sub-20180809_G5 | sam-20180809_G5 | compression    | Colon, inner submucosal plexus |
| sub-20180813_G5 | sam-20180813_G5 | compression    | Colon, inner submucosal plexus |
| sub-20180821_G5 | sam-20180821_G5 | compression    | Colon, inner submucosal plexus |
| sub-20180827_G3 | sam-20180827_G3 | compression    | Colon, inner submucosal plexus |
| sub-20180828_G2 | sam-20180828_G2 | compression    | Colon, inner submucosal plexus |
| sub-20180905_G1 | sam-20180905_G1 | compression    | Colon, inner submucosal plexus |
| sub-20180906_G3 | sam-20180906_G3 | compression    | Colon, inner submucosal plexus |
| sub-20180911_G5 | sam-20180911_G5 | compression    | Colon, inner submucosal plexus |

** Anatomical entities
*** Dataset
**** Involves
# FIXME unused at the moment
#+begin_src sparql :var limit="30"
SELECT DISTINCT
?dataset
?protocol
#?ae
(str(?aes) as ?entity)
WHERE {
  ?dataset a sparc:Dataset .
  ?dataset TEMP:hasProtocol ?protocol .
  ?protocol TEMPRAW:involvesAnatomicalRegion ?aes .
  # ?ae rdfs:label ?l_ae .
}
ORDER BY ASC(?entity)
LIMIT ?limit
#+end_src

#+RESULTS:
| dataset                                      | protocol      | entity                                  |
|----------------------------------------------+---------------+-----------------------------------------|
| dataset:07c31ef4-cc72-4348-813a-f074675643ed | pio.api:19369 |                                         |
| dataset:ac2279ba-b8b0-4214-98af-437111a2ae61 | pio.api:32915 | 2 CMOS cameras (SciMedia, MiCAM ULTIMA) |
| dataset:6ce2e98e-5217-4952-897d-017285d303b2 | pio.api:18769 | BAT                                     |
| dataset:fd2de29c-4f29-494c-8da4-b157a10223ef | pio.api:18925 | BAT                                     |
| dataset:5f54d5c1-82ab-4a4c-b3bc-5b6767419010 | pio.api:36610 | Bladder                                 |
| dataset:ca9afa19-b616-41a9-a532-3ae5aaf4088f | pio.api:22894 | C2 and C3 dorsal roots                  |
| dataset:ca9afa19-b616-41a9-a532-3ae5aaf4088f | pio.api:22894 | C2 lamina                               |
| dataset:ca9afa19-b616-41a9-a532-3ae5aaf4088f | pio.api:22894 | C2 nerve roots                          |
| dataset:ae5ee3dc-1766-4c0d-a18f-c6ea2bb367c0 | pio.api:30983 | Cervical Vagus Nerve                    |
| dataset:9b5f78ac-850a-43ab-aebe-c15b470a008b | pio.api:19127 | Coeliac ganglia                         |
| dataset:b4e7758e-9a8f-4806-9bb0-1d5e7098df6a | pio.api:19127 | Coeliac ganglia                         |
| dataset:c23e9319-fe3c-4354-aca8-259e8cff0f7a | pio.api:19127 | Coeliac ganglia                         |
| dataset:fce3f57f-18ea-4453-887e-58a885e90e7e | pio.api:19127 | Coeliac ganglia                         |
| dataset:43da251b-59bd-43fa-8a8a-3a0276da968f | pio.api:18947 | Coeliac ganglia                         |
| dataset:458d3e2c-8f75-4298-bf10-8322b058b148 | pio.api:18947 | Coeliac ganglia                         |
| dataset:78e5602a-98a8-4323-8efd-db77466030c3 | pio.api:18947 | Coeliac ganglia                         |
| dataset:8742cd78-1ad8-4c17-aa12-42c06e898ded | pio.api:18947 | Coeliac ganglia                         |
| dataset:9b5f78ac-850a-43ab-aebe-c15b470a008b | pio.api:18947 | Coeliac ganglia                         |
| dataset:b4e7758e-9a8f-4806-9bb0-1d5e7098df6a | pio.api:18947 | Coeliac ganglia                         |
| dataset:c23e9319-fe3c-4354-aca8-259e8cff0f7a | pio.api:18947 | Coeliac ganglia                         |
| dataset:fce3f57f-18ea-4453-887e-58a885e90e7e | pio.api:18947 | Coeliac ganglia                         |
| dataset:43da251b-59bd-43fa-8a8a-3a0276da968f | pio.api:19127 | Coeliac ganglia                         |
| dataset:458d3e2c-8f75-4298-bf10-8322b058b148 | pio.api:19127 | Coeliac ganglia                         |
| dataset:78e5602a-98a8-4323-8efd-db77466030c3 | pio.api:19127 | Coeliac ganglia                         |
| dataset:8742cd78-1ad8-4c17-aa12-42c06e898ded | pio.api:19127 | Coeliac ganglia                         |
| dataset:277a76fa-7f1e-4a19-9a70-d0729beef331 | pio.api:24077 | Colon                                   |
| dataset:91dab959-7600-4f14-bae3-d1e6ba5c15ae | pio.api:24077 | Colon                                   |
| dataset:98e467ce-7e43-4bbd-8ee7-ab8e2adcc6c0 | pio.api:24077 | Colon                                   |
| dataset:43da251b-59bd-43fa-8a8a-3a0276da968f | pio.api:19127 | Dorsal Root Ganglia                     |
| dataset:458d3e2c-8f75-4298-bf10-8322b058b148 | pio.api:19127 | Dorsal Root Ganglia                     |

**** About
#+begin_src sparql
SELECT DISTINCT
?dataset
# ?ae
(str(?l_ae) as ?entity)
WHERE {
  ?dataset a sparc:Dataset .
  ?dataset isAbout: ?ae .  # TODO not 100% on the modelling here
  ?ae rdfs:label ?l_ae .
  ?ae rdfs:subClassOf* UBERON:0001062 .  # have to load uberon for this
}
ORDER BY ASC(?l_ae)
LIMIT ?limit
#+end_src

#+RESULTS:
| dataset                                      | entity                   |
|----------------------------------------------+--------------------------|
| dataset:1284a4e8-21e1-4b9f-9280-6ba06f6b9a50 | adipose tissue           |
| dataset:1873396f-8d82-4d6c-93f7-52117470e4a1 | autonomic nervous system |
| dataset:1b137c7e-2f07-4a78-8079-828b37743306 | autonomic nervous system |
| dataset:21957eae-0824-4fb5-b18f-04d6ed12ce18 | autonomic nervous system |
| dataset:29df9b97-a20b-469c-bf48-9389f1e31a11 | axon tract               |
| dataset:11d3dbdf-d90c-4e42-8341-cc4a956f5c9c | bladder organ            |
| dataset:7067a6f5-8df2-4ef8-953a-4d0bfafe6555 | bladder organ            |
| dataset:b2a88634-e2b0-49dc-9fe3-f61f784459f2 | bladder organ            |
| dataset:f7570dd0-24c4-4bc8-8faf-b93bd0e759f3 | bladder organ            |
| dataset:b0c104b4-f448-4a33-9adb-33704a1890f8 | body of stomach          |

**** Sample Source
#+name: dataset-sample-source
#+begin_src sparql :var limit="20"
SELECT DISTINCT
?dataset
(str(?ae) as ?aes)
# ?slid
WHERE {
  ?sample TEMP:hasDerivedInformationAsParticipant ?dataset .
  ?sample TEMPRAW:wasExtractedFromAnatomicalRegion ?ae .
  ?sample a sparc:Sample .
  # ?sample TEMP:localId ?slid .
  ?dataset a sparc:Dataset .
}
ORDER BY
DESC(?ae)
# ASC(?slid)
LIMIT ?limit
#+end_src

#+RESULTS: dataset-sample-source
| dataset                                      | aes                             |
|----------------------------------------------+---------------------------------|
| dataset:b225fa8a-9eb5-4716-8399-0f7fac9c2b64 | whole stomach                   |
| dataset:82c228a2-134a-4f6f-82f2-d89e64cb7be1 | whole stomach                   |
| dataset:57466879-2cdd-4af2-8bd6-7d867423c709 | vasculature of the the pancreas |
| dataset:91b1cfca-05e9-4445-bac8-04bf7a4593f1 | transverse colon                |
| dataset:4a361ad8-d500-4f3d-81f8-c92f504946b2 | torus pyloricus                 |
| dataset:21957eae-0824-4fb5-b18f-04d6ed12ce18 | systemic                        |
| dataset:3a7ccb46-4320-4409-b359-7f4a7027bb9c | superior cervical ganglia       |
| dataset:6fa2666c-aa3d-4e27-a405-7848fc061b04 | subdiaphragmatic vagus nerve    |
| dataset:bec4d335-9377-4863-9017-ecd01170f354 | subdiaphragmatic vagus nerve    |
| dataset:c082215b-6765-4cc8-a965-92773b4c18c1 | subdiaphragmatic vagus nerve    |
| dataset:e8816bce-809a-4c78-8950-6f61911b6eac | stomach                         |
| dataset:c50d5ab3-1370-4492-9d16-00834e0d34f3 | stellate ganglion/T1-T5         |
| dataset:c34c5b05-4934-4a17-953c-069adf3aec46 | stellate ganglion               |
| dataset:d1f386c0-1715-49ce-be14-890a4ede011d | stellate ganglion               |
| dataset:e8816bce-809a-4c78-8950-6f61911b6eac | spleen                          |
| dataset:9d8ad16c-2ae7-414c-8573-048303039c76 | spinal cord, segments L5-S2     |
| dataset:7d3aed89-ca43-41f5-9f21-e4bbce0d5888 | sigmoid colon                   |
| dataset:03dd0308-c7c0-47ab-b9ae-03042723b1ce | sigmoid colon                   |
| dataset:aec9ab8f-3c7f-4dd2-a638-466a6fb57f96 | sigma                           |
| dataset:be6c03c9-e427-488a-9dea-f4f64fca1f14 | sample middle ~2 cm             |

*** Protocol
**** Simple
#+begin_src sparql :var limit="10"
SELECT DISTINCT
?protocol
WHERE {
  ?protocol a sparc:Protocol .
  FILTER CONTAINS(str(?protocol), "protocols.io")
} LIMIT ?limit
#+end_src

#+RESULTS:
| protocol      |
|---------------|
| pio.api:18394 |
| pio.api:18417 |
| pio.api:18444 |
| pio.api:18445 |
| pio.api:18539 |
| pio.api:18578 |
| pio.api:18595 |
| pio.api:18655 |
| pio.api:18663 |
| pio.api:18769 |

**** Protocol triples
#+begin_src sparql :var limit="20"
SELECT DISTINCT
?protocol
?p
?o
WHERE {
  ?protocol a sparc:Protocol .
  ?protocol ?p ?o
  FILTER CONTAINS(str(?protocol), "protocols.io")
} LIMIT ?limit
#+end_src

#+RESULTS:
| protocol      | p                                  | o                                  |
|---------------+------------------------------------+------------------------------------|
| pio.api:18394 | TEMP:hasNumberOfProtcurAnnotations | 63                                 |
| pio.api:18394 | TEMP:protocolEmploysTechnique      | tech:libraryPrep                   |
| pio.api:18394 | TEMP:protocolInvolvesAction        | hyp-protcur:4F6uUDCwEemuIwe2CVh8qw |
| pio.api:18394 | TEMP:protocolInvolvesAction        | hyp-protcur:dATrNFDbEemP_Pt1hFU0Jg |
| pio.api:18394 | TEMP:protocolInvolvesAction        | hyp-protcur:Eexs4kTsEem4nRdvaoZSBA |
| pio.api:18394 | TEMP:protocolInvolvesAction        | hyp-protcur:EKfe_DCwEemocGufjfOTWw |
| pio.api:18394 | TEMP:protocolInvolvesAction        | hyp-protcur:eoEhhjCvEemMdjMzyrpv_w |
| pio.api:18394 | TEMP:protocolInvolvesAction        | hyp-protcur:eR8AzkTrEemyKMNIUcyiDQ |
| pio.api:18394 | TEMP:protocolInvolvesAction        | hyp-protcur:fNEBiETpEemLec_DS2dlpQ |
| pio.api:18394 | TEMP:protocolInvolvesAction        | hyp-protcur:gqhZvjCwEemuIivyBGDcHg |
| pio.api:18394 | TEMP:protocolInvolvesAction        | hyp-protcur:hBM99jCvEempX7O2kC2gWQ |
| pio.api:18394 | TEMP:protocolInvolvesAction        | hyp-protcur:hW9jEkToEemm91_9sqXgdg |
| pio.api:18394 | TEMP:protocolInvolvesAction        | hyp-protcur:i7vKoDCvEemMd1tB16R8lg |
| pio.api:18394 | TEMP:protocolInvolvesAction        | hyp-protcur:J4e-RDCwEemjsb-nUO42IA |
| pio.api:18394 | TEMP:protocolInvolvesAction        | hyp-protcur:LhWxbDCwEem83ttc8K5YCg |
| pio.api:18394 | TEMP:protocolInvolvesAction        | hyp-protcur:lPXfUkTrEemhtU_Jwz0Gyw |
| pio.api:18394 | TEMP:protocolInvolvesAction        | hyp-protcur:Mtec6DCvEemma080RWXdWw |
| pio.api:18394 | TEMP:protocolInvolvesAction        | hyp-protcur:OHfIOjCvEem88rcFq1qp4Q |
| pio.api:18394 | TEMP:protocolInvolvesAction        | hyp-protcur:pSUcjjCwEemp22thowiTcw |
| pio.api:18394 | TEMP:protocolInvolvesAction        | hyp-protcur:PyxS-DCwEemeJA9Q0nCKog |

**** Involves
NOTE In order for these to work with subClassOf =UBERON= uberon must be loaded.
#+begin_src sparql :var limit="20"
SELECT DISTINCT
?protocol
?bb_value
(str(?l_bb) as ?ls)
WHERE {
  ?protocol a sparc:Protocol .
  ?protocol TEMP:protocolInvolvesBlackBox ?ast_bb .

  ?ast_bb rdf:type protcur:black-box .  # TODO need to refine on organ an ingest the new alignment
  ?ast_bb TEMP:hasValue ?bb_value .

  ?bb_value rdfs:subClassOf+ UBERON:0001062 .
  ?bb_value rdfs:label ?l_bb .
} LIMIT ?limit
#+end_src

#+RESULTS:
| protocol      | bb_value       | ls                        |
|---------------+----------------+---------------------------|
| pio.api:18947 | UBERON:0003684 | abdominal cavity          |
| pio.api:19127 | UBERON:0003684 | abdominal cavity          |
| pio.api:20025 | UBERON:0006082 | fundus of urinary bladder |
| pio.api:26704 | UBERON:0000974 | neck                      |
| pio.api:19341 | UBERON:0005363 | inferior vagus X ganglion |
| pio.api:23160 | UBERON:0014398 | respiratory muscle        |
| pio.api:22833 | UBERON:0000945 | stomach                   |
| pio.api:25817 | UBERON:0000948 | heart                     |

# seems like there are some issues with labels https://jira.blazegraph.com/browse/BLZG-4476
# :format application/sparql-results+xml
#+begin_src sparql :var limit="20"
SELECT DISTINCT
?protocol
?bbc_value
(str(?l_bbc) as ?bbl)
WHERE {
  ?protocol a sparc:Protocol .
  ?protocol TEMP:protocolInvolvesBlackBoxComponent ?ast_bbc .

  ?ast_bbc rdf:type protcur:black-box-component .  # TODO need to refine on organ an ingest the new alignment
  ?ast_bbc TEMP:hasValue ?bbc_value .

  ?bbc_value rdfs:subClassOf+ UBERON:0001062 .
  ?bbc_value rdfs:label ?l_bbc .
} ORDER BY ?bbl LIMIT ?limit
#+end_src

#+RESULTS:
| protocol      | bbc_value      | bbl     |
|---------------+----------------+---------|
| pio.api:19297 | UBERON:0000916 | abdomen |
| pio.api:26737 | UBERON:0000916 | abdomen |
| pio.api:19255 | UBERON:0000916 | abdomen |
| pio.api:19269 | UBERON:0000916 | abdomen |
| pio.api:36547 | UBERON:0000916 | abdomen |
| pio.api:19341 | UBERON:0000916 | abdomen |
| pio.api:36609 | UBERON:0000916 | abdomen |
| pio.api:31143 | UBERON:0000916 | abdomen |
| pio.api:25923 | UBERON:0000916 | abdomen |
| pio.api:19299 | UBERON:0000916 | abdomen |
| pio.api:18655 | UBERON:0000916 | abdomen |
| pio.api:18663 | UBERON:0000916 | abdomen |
| pio.api:36610 | UBERON:0000916 | abdomen |
| pio.api:19298 | UBERON:0000916 | abdomen |
| pio.api:18786 | UBERON:0000916 | abdomen |
| pio.api:36552 | UBERON:0000916 | abdomen |
| pio.api:36617 | UBERON:0000916 | abdomen |
| pio.api:19127 | UBERON:0000916 | abdomen |
| pio.api:22900 | UBERON:0000916 | abdomen |
| pio.api:26687 | UBERON:0000916 | abdomen |

** Uberon tests
In order to use these you need to load the latest version of uberon into blazegraph.
#+begin_src sparql :var limit="15"
SELECT DISTINCT ?sc (str(?l) as ?label) WHERE {
  # BIND("brain" AS ?label) # Well would you look at that!
  VALUES (?root) { ( UBERON:0001062 ) }
  ?sc rdfs:subClassOf+ ?root .
  ?sc rdfs:label ?l .
} ORDER BY ASC(?label) LIMIT ?limit
#+end_src

#+RESULTS:
| sc             | label                                               |
|----------------+-----------------------------------------------------|
| UBERON:0013155 | 1st arch mandibular ectoderm                        |
| UBERON:0013156 | 1st arch mandibular endoderm                        |
| UBERON:0010339 | 1st arch mandibular mesenchyme from head mesenchyme |
| UBERON:0007238 | 1st arch maxillary component                        |
| UBERON:0012313 | 1st arch maxillary ectoderm                         |
| UBERON:0013154 | 1st arch maxillary endoderm                         |
| UBERON:0010338 | 1st arch maxillary mesenchyme from head mesenchyme  |
| UBERON:0013157 | 1st arch maxillary-mandibular cleft                 |
| UBERON:0010341 | 1st arch mesenchyme from head mesenchyme            |
| UBERON:0005872 | 1st arch pharyngeal cleft                           |
| UBERON:0019249 | 2-cell stage embryo                                 |
| UBERON:0005660 | 2nd arch ectoderm                                   |
| UBERON:0005664 | 2nd arch endoderm                                   |
| UBERON:0005689 | 2nd arch mesenchyme                                 |
| UBERON:0010343 | 2nd arch mesenchyme from head mesenchyme            |

#+begin_src sparql
select ?p ?o where {
    VALUES (?s) { ( UBERON:0001062 ) }
    ?s ?p ?o .
}
#+end_src

#+RESULTS:
| p                        | o                                                                                                                                                                         |
|--------------------------+---------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| oboInOwl:id              | UBERON:0001062                                                                                                                                                            |
| definition:              | Biological entity that is either an individual member of a biological species or constitutes the structural organization of an individual member of a biological species. |
| oboInOwl:hasDbXref       | AAO:0010841                                                                                                                                                               |
| oboInOwl:hasDbXref       | AEO:0000000                                                                                                                                                               |
| oboInOwl:hasDbXref       | BILA:0000000                                                                                                                                                              |
| oboInOwl:hasDbXref       | BIRNLEX:6                                                                                                                                                                 |
| oboInOwl:hasDbXref       | CARO:0000000                                                                                                                                                              |
| oboInOwl:hasDbXref       | EHDAA2:0002229                                                                                                                                                            |
| oboInOwl:hasDbXref       | FBbt_root:00000000                                                                                                                                                        |
| oboInOwl:hasDbXref       | FBbt:10000000                                                                                                                                                             |
| oboInOwl:hasDbXref       | FMA:62955                                                                                                                                                                 |
| oboInOwl:hasDbXref       | HAO:0000000                                                                                                                                                               |
| oboInOwl:hasDbXref       | MA:0000001                                                                                                                                                                |
| oboInOwl:hasDbXref       | NCIT:C12219                                                                                                                                                               |
| oboInOwl:hasDbXref       | TAO:0100000                                                                                                                                                               |
| oboInOwl:hasDbXref       | TGMA:0001822                                                                                                                                                              |
| oboInOwl:hasDbXref       | UMLS:C1515976                                                                                                                                                             |
| oboInOwl:hasDbXref       | WBbt:0000100                                                                                                                                                              |
| oboInOwl:hasDbXref       | XAO:0000000                                                                                                                                                               |
| oboInOwl:hasDbXref       | ZFA:0100000                                                                                                                                                               |
| oboInOwl:hasDbXref       | http://linkedlifedata.com/resource/umls/id/C1515976                                                                                                                       |
| oboInOwl:hasOBONamespace | uberon                                                                                                                                                                    |
| oboInOwl:inSubset        | http://purl.obolibrary.org/obo/uberon/core#upper_level                                                                                                                    |
| rdf:type                 | owl:Class                                                                                                                                                                 |
| rdfs:label               | anatomical entity                                                                                                                                                         |

** Associated scaffolds
** Manifest files
A SODA development use case. Find me datasets that have top level manifests with no errors.
#+begin_src sparql
SELECT DISTINCT
?dataset
WHERE {
  ?dataset a sparc:Dataset .
  ?dataset TEMP:hasPart+ ?file .
  ?file a sparc:File .
  ?file a sparc:Manifest .
  ?file TEMP:hasParent ?dataset . # this is the tricky bit, because we conflate the identifier for dataset and the folder
  ?file TEMP:hasErrors 0 .
}
LIMIT ?limit
#+end_src
** Contributors
*** Count
#+begin_src sparql
SELECT DISTINCT
(COUNT(DISTINCT ?person) as ?cp)
WHERE {
  ?person a sparc:Person .
}
LIMIT ?limit
#+end_src

#+RESULTS:
|  cp |
|-----|
| 656 |

*** ORCiD
Count the number of contributors that have ORCiDs.
#+begin_src sparql
SELECT DISTINCT
(COUNT(DISTINCT ?person) as ?cp)
#?fn
#?ln
WHERE {
  ?person a sparc:Person .
  ?person sparc:firstName ?fn .
  ?person sparc:lastName ?ln .
  FILTER CONTAINS(str(?person), "orcid.org")
}
LIMIT ?limit
#+end_src

#+RESULTS:
|  cp |
|-----|
| 257 |

** Other
NOTE These are not yet in the ttl file, the queries written here will not work yet.
*** File types
In all likelihood we are not going to include the names of each of the
individual files in the standard ttl export. We may put it in a named
graph and then update the journal, possibly only for released
datasets. The use cases for having individual files in the graph is
not at all clear, we might have individual folders, or run it in the
other direction where a subject could list the folders that contain
data about it.  Trying to keep the graph in sync with Blackfynn would
be quite a pain, essentially we would store/append every single file
that ever appears and then mark the deleted ones as deleted or something.
#+begin_src sparql
SELECT DISTINCT
?dataset
?file_type
WHERE {
  ?dataset a sparc:Dataset .
  ?dataset TEMP:containsFileWithType ?file_type .  # TODO not 100% on the modelling here
}
LIMIT ?limit
#+end_src
*** Has Raw Data
#+begin_src sparql
SELECT DISTINCT
?dataset
?raw
WHERE {
  ?dataset a sparc:Dataset .
  ?dataset TEMP:containsFolderForRawData ?raw .  # TODO not 100% on the modelling here
}
LIMIT ?limit
#+end_src
*** Has Derived Data
#+begin_src sparql
SELECT DISTINCT
?dataset
?derived
WHERE {
  ?dataset a sparc:Dataset .
  ?dataset TEMP:containsFolderForDerivedData ?derived .  # TODO not 100% on the modelling here
}
LIMIT ?limit
#+end_src
*** Has Code
#+begin_src sparql
SELECT DISTINCT
?dataset
?code
WHERE {
  ?dataset a sparc:Dataset .
  ?dataset TEMP:containsFolderForCode ?code .  # TODO not 100% on the modelling here
}
LIMIT ?limit
#+end_src
*** Used in simulation
This modeling is extremely preliminary.
#+begin_src sparql
SELECT DISTINCT
?dataset
?dataset_sim
WHERE {
  ?dataset a sparc:Dataset .
  ?dataset_sim a sparc:Dataset .  # TODO not 100% on this
  # the dataset holds the simulation, and is also what references the other datasets
  # whether we need an explicit type for simulation datasets is not clear, I suspect
  # that we do not, since datasets are just data, the aboutness or typeness probably
  # should come from the fact that the dataset specifies or houses a simulation ...
  # ?dataset_sim a sparc:SimulationDataset . # also not good
  # ?dataset_sim TEMP:isSubstrateForSomeComputationalSimulation true .  # FIXME this is bad bad bad
  VALUES ?p {TEMP:derivesParametersFrom TEMP:derivesValidationDataFrom ilxtr:hasInformationInput} .
  ?dataset_sim ?p ?dataset .
}
LIMIT ?limit
#+end_src
** Subject reconciliation
# #+header: :cache yes
#+name: potential-duplicate-subjects
#+begin_src sparql
# :results table
# RUN:block
SELECT distinct ?s1 ?s2 ?id ?dataset1 ?dataset2 ?species1 ?species2 ?award1 ?award2
WHERE {

  # Give me all subjects with duplicate IDs with unique datasets
  { SELECT ?id
    WHERE {
	  ?s1 a owl:NamedIndividual ;
	  TEMP:localId ?id ;
	  TEMP:hasDerivedInformationAsParticipant ?datasetx .
	  ?s2 a owl:NamedIndividual ;
	  TEMP:localId ?id ;
	  TEMP:hasDerivedInformationAsParticipant ?datasety .
	  filter(?datasetx != ?datasety)
    } GROUP BY ?id having (count(?id) > 1)}

  # filter out the cases where there can't be a match because species doesn't match
  ?s1 TEMP:localId ?id ;
  sparc:animalSubjectIsOfSpecies ?species1;
  TEMP:hasDerivedInformationAsParticipant ?dataset1 .
  ?s2 TEMP:localId ?id ;
  sparc:animalSubjectIsOfSpecies ?species2;
  TEMP:hasDerivedInformationAsParticipant ?dataset2 .
  filter(?s1 != ?s2)
  filter(STR(IRI(?s1)) < STR(IRI(?s2))) # this is a hack to filter out duplicate triples
  filter(?species1 != ?species2)
  filter(STR(IRI(?species1)) < STR(IRI(?species2))) # hack to filter dupe triples

  # filter to find non-matching awards
  # using contact person doesn't make sense as they are 1:1 with award right now
  ?dataset1 a owl:NamedIndividual ;
  TEMP:hasAwardNumber ?award1 .
  ?dataset2 a owl:NamedIndividual ;
  TEMP:hasAwardNumber ?award2 .
  filter(?dataset1 != ?dataset2)
  filter(STR(IRI(?dataset1)) < STR(IRI(?dataset2))) # hack to filter dupe triples
  filter(?award1 != ?award2)
  filter(STR(IRI(?award1)) < STR(IRI(?award2))) # hack to filter dupe triples

} order by ?id limit 1000
#+end_src

# *[[RUN:][Run Query ▶]]*
# #+header: :results drawer output
#+header: :epilogue "return result"
#+name: process-duplicate-subjects
#+begin_src python :var data=potential-duplicate-subjects() :exports results
from collections import defaultdict, OrderedDict
import itertools
from sparcur.core import OntId

def func(data):
    idmap = defaultdict(lambda: defaultdict(list)) # change to list; order for local_id
    for row in data:
        subj1, subj2, local_id = row[0], row[1], row[2]
        if not idmap[subj1]['local_id']:
            idmap[subj1]['local_id'].append(local_id)
        idmap[subj1]['cluster'].append(subj2)
        idmap[subj1]['local_id'].append(local_id)
        value_pairs = [(row[i], row[i+1]) for i in range(3, len(row), 2)]
        value_pairs_len = len(value_pairs)
        for i, value_pair in enumerate(value_pairs):
            v1, v2 = value_pair
            if v1 not in idmap[subj1][i]:
                idmap[subj1][i].append(v1)
            idmap[subj1][i].append(v2)
    header = ['cluster', 'local_id'] + [i for i in range(value_pairs_len)] # todo: replace this with sparql headers if possible
    columns = defaultdict(list)
    subjs = sorted([(v, v.split('/')[-1]) for v in idmap], key=lambda x: x[1])
    for subj, _ in subjs:
        padding_max = max([len(v) for v in idmap[subj].values()])
        for colname, values in idmap[subj].items():
            values = list(values)
            values = [subj] + values if colname == 'cluster' else values
            padding = padding_max - len(values) if len(values) < padding_max else 0
            columns[colname] += values # + ['-'] * padding + ['']
    thing = [list(_) for _ in itertools.zip_longest(*[columns[k] for k in header])]
    for index in (0, 2, 3, 4):
        for row in thing:
            row[index] = OntId(row[index]).curie  # shorten iris
    hardcoded_header =  [f'individuals (n={len(thing)})',
                         f'id (n={len(set([r[1] for r in thing]))})',
                         'datasets', 'species', 'awards']
    table = [hardcoded_header] + [None] + sorted(set(tuple(_) for _ in thing), key=lambda row:(row[1], row[3], row[4], row[2]))
    return table


result = func(data)
#+end_src

#+RESULTS: process-duplicate-subjects
| individuals (n=94)                                           | id (n=10) | datasets                                     | species         | awards             |
|--------------------------------------------------------------+-----------+----------------------------------------------+-----------------+--------------------|
| dataset:64c64ed8-31b1-4011-80b6-21a873e8c807/subjects/sub-1  | sub-1     | dataset:64c64ed8-31b1-4011-80b6-21a873e8c807 | NCBITaxon:10090 | awards:OT2OD024909 |
| dataset:9b5f78ac-850a-43ab-aebe-c15b470a008b/subjects/sub-1  | sub-1     | dataset:9b5f78ac-850a-43ab-aebe-c15b470a008b | NCBITaxon:10116 | awards:OT2OD024912 |
| dataset:02d6f93c-56cd-471b-bbb9-99f65f47d203/subjects/sub-10 | sub-10    | dataset:02d6f93c-56cd-471b-bbb9-99f65f47d203 | NCBITaxon:9615  | awards:OT2OD025308 |
| dataset:60739e5f-5210-4d04-935d-9f2645b3977f/subjects/sub-10 | sub-10    | dataset:60739e5f-5210-4d04-935d-9f2645b3977f | NCBITaxon:9615  | awards:OT2OD025308 |
| dataset:3951ecbd-e20f-4650-8385-1b45f4a9b7fb/subjects/sub-10 | sub-10    | dataset:3951ecbd-e20f-4650-8385-1b45f4a9b7fb | NCBITaxon:9825  | awards:OT2OD025340 |
| dataset:6c059ef7-f94a-40af-ab5a-50f482737fc1/subjects/sub-10 | sub-10    | dataset:6c059ef7-f94a-40af-ab5a-50f482737fc1 | NCBITaxon:9825  | awards:OT2OD025340 |
| dataset:92f31530-41e6-4844-8ed8-6d1d534254f5/subjects/sub-10 | sub-10    | dataset:92f31530-41e6-4844-8ed8-6d1d534254f5 | NCBITaxon:9825  | awards:OT2OD025340 |
| dataset:be6c03c9-e427-488a-9dea-f4f64fca1f14/subjects/sub-10 | sub-10    | dataset:be6c03c9-e427-488a-9dea-f4f64fca1f14 | NCBITaxon:9825  | awards:OT2OD025340 |
| dataset:02d6f93c-56cd-471b-bbb9-99f65f47d203/subjects/sub-11 | sub-11    | dataset:02d6f93c-56cd-471b-bbb9-99f65f47d203 | NCBITaxon:9615  | awards:OT2OD025308 |
| dataset:60739e5f-5210-4d04-935d-9f2645b3977f/subjects/sub-11 | sub-11    | dataset:60739e5f-5210-4d04-935d-9f2645b3977f | NCBITaxon:9615  | awards:OT2OD025308 |
| dataset:3951ecbd-e20f-4650-8385-1b45f4a9b7fb/subjects/sub-11 | sub-11    | dataset:3951ecbd-e20f-4650-8385-1b45f4a9b7fb | NCBITaxon:9825  | awards:OT2OD025340 |
| dataset:6c059ef7-f94a-40af-ab5a-50f482737fc1/subjects/sub-11 | sub-11    | dataset:6c059ef7-f94a-40af-ab5a-50f482737fc1 | NCBITaxon:9825  | awards:OT2OD025340 |
| dataset:92f31530-41e6-4844-8ed8-6d1d534254f5/subjects/sub-11 | sub-11    | dataset:92f31530-41e6-4844-8ed8-6d1d534254f5 | NCBITaxon:9825  | awards:OT2OD025340 |
| dataset:be6c03c9-e427-488a-9dea-f4f64fca1f14/subjects/sub-11 | sub-11    | dataset:be6c03c9-e427-488a-9dea-f4f64fca1f14 | NCBITaxon:9825  | awards:OT2OD025340 |
| dataset:02d6f93c-56cd-471b-bbb9-99f65f47d203/subjects/sub-12 | sub-12    | dataset:02d6f93c-56cd-471b-bbb9-99f65f47d203 | NCBITaxon:9615  | awards:OT2OD025308 |
| dataset:60739e5f-5210-4d04-935d-9f2645b3977f/subjects/sub-12 | sub-12    | dataset:60739e5f-5210-4d04-935d-9f2645b3977f | NCBITaxon:9615  | awards:OT2OD025308 |
| dataset:3951ecbd-e20f-4650-8385-1b45f4a9b7fb/subjects/sub-12 | sub-12    | dataset:3951ecbd-e20f-4650-8385-1b45f4a9b7fb | NCBITaxon:9825  | awards:OT2OD025340 |
| dataset:6c059ef7-f94a-40af-ab5a-50f482737fc1/subjects/sub-12 | sub-12    | dataset:6c059ef7-f94a-40af-ab5a-50f482737fc1 | NCBITaxon:9825  | awards:OT2OD025340 |
| dataset:92f31530-41e6-4844-8ed8-6d1d534254f5/subjects/sub-12 | sub-12    | dataset:92f31530-41e6-4844-8ed8-6d1d534254f5 | NCBITaxon:9825  | awards:OT2OD025340 |
| dataset:be6c03c9-e427-488a-9dea-f4f64fca1f14/subjects/sub-12 | sub-12    | dataset:be6c03c9-e427-488a-9dea-f4f64fca1f14 | NCBITaxon:9825  | awards:OT2OD025340 |
| dataset:64c64ed8-31b1-4011-80b6-21a873e8c807/subjects/sub-4  | sub-4     | dataset:64c64ed8-31b1-4011-80b6-21a873e8c807 | NCBITaxon:10090 | awards:OT2OD024909 |
| dataset:7a338939-fd82-4dbe-a1c0-3c0632fdd7ef/subjects/sub-4  | sub-4     | dataset:7a338939-fd82-4dbe-a1c0-3c0632fdd7ef | NCBITaxon:9606  | awards:OT2OD024899 |
| dataset:6c059ef7-f94a-40af-ab5a-50f482737fc1/subjects/sub-4  | sub-4     | dataset:6c059ef7-f94a-40af-ab5a-50f482737fc1 | NCBITaxon:9825  | awards:OT2OD025340 |
| dataset:92f31530-41e6-4844-8ed8-6d1d534254f5/subjects/sub-4  | sub-4     | dataset:92f31530-41e6-4844-8ed8-6d1d534254f5 | NCBITaxon:9825  | awards:OT2OD025340 |
| dataset:be6c03c9-e427-488a-9dea-f4f64fca1f14/subjects/sub-4  | sub-4     | dataset:be6c03c9-e427-488a-9dea-f4f64fca1f14 | NCBITaxon:9825  | awards:OT2OD025340 |
| dataset:64c64ed8-31b1-4011-80b6-21a873e8c807/subjects/sub-5  | sub-5     | dataset:64c64ed8-31b1-4011-80b6-21a873e8c807 | NCBITaxon:10090 | awards:OT2OD024909 |
| dataset:83fdbd3f-6028-4276-b2f0-bc6691b0d3cb/subjects/sub-5  | sub-5     | dataset:83fdbd3f-6028-4276-b2f0-bc6691b0d3cb | NCBITaxon:10116 | awards:OT2OD025340 |
| dataset:7a338939-fd82-4dbe-a1c0-3c0632fdd7ef/subjects/sub-5  | sub-5     | dataset:7a338939-fd82-4dbe-a1c0-3c0632fdd7ef | NCBITaxon:9606  | awards:OT2OD024899 |
| dataset:02d6f93c-56cd-471b-bbb9-99f65f47d203/subjects/sub-5  | sub-5     | dataset:02d6f93c-56cd-471b-bbb9-99f65f47d203 | NCBITaxon:9615  | awards:OT2OD025308 |
| dataset:3951ecbd-e20f-4650-8385-1b45f4a9b7fb/subjects/sub-5  | sub-5     | dataset:3951ecbd-e20f-4650-8385-1b45f4a9b7fb | NCBITaxon:9825  | awards:OT2OD025340 |
| dataset:6c059ef7-f94a-40af-ab5a-50f482737fc1/subjects/sub-5  | sub-5     | dataset:6c059ef7-f94a-40af-ab5a-50f482737fc1 | NCBITaxon:9825  | awards:OT2OD025340 |
| dataset:92f31530-41e6-4844-8ed8-6d1d534254f5/subjects/sub-5  | sub-5     | dataset:92f31530-41e6-4844-8ed8-6d1d534254f5 | NCBITaxon:9825  | awards:OT2OD025340 |
| dataset:be6c03c9-e427-488a-9dea-f4f64fca1f14/subjects/sub-5  | sub-5     | dataset:be6c03c9-e427-488a-9dea-f4f64fca1f14 | NCBITaxon:9825  | awards:OT2OD025340 |
| dataset:64c64ed8-31b1-4011-80b6-21a873e8c807/subjects/sub-6  | sub-6     | dataset:64c64ed8-31b1-4011-80b6-21a873e8c807 | NCBITaxon:10090 | awards:OT2OD024909 |
| dataset:7a338939-fd82-4dbe-a1c0-3c0632fdd7ef/subjects/sub-6  | sub-6     | dataset:7a338939-fd82-4dbe-a1c0-3c0632fdd7ef | NCBITaxon:9606  | awards:OT2OD024899 |
| dataset:02d6f93c-56cd-471b-bbb9-99f65f47d203/subjects/sub-6  | sub-6     | dataset:02d6f93c-56cd-471b-bbb9-99f65f47d203 | NCBITaxon:9615  | awards:OT2OD025308 |
| dataset:3951ecbd-e20f-4650-8385-1b45f4a9b7fb/subjects/sub-6  | sub-6     | dataset:3951ecbd-e20f-4650-8385-1b45f4a9b7fb | NCBITaxon:9825  | awards:OT2OD025340 |
| dataset:6c059ef7-f94a-40af-ab5a-50f482737fc1/subjects/sub-6  | sub-6     | dataset:6c059ef7-f94a-40af-ab5a-50f482737fc1 | NCBITaxon:9825  | awards:OT2OD025340 |
| dataset:92f31530-41e6-4844-8ed8-6d1d534254f5/subjects/sub-6  | sub-6     | dataset:92f31530-41e6-4844-8ed8-6d1d534254f5 | NCBITaxon:9825  | awards:OT2OD025340 |
| dataset:be6c03c9-e427-488a-9dea-f4f64fca1f14/subjects/sub-6  | sub-6     | dataset:be6c03c9-e427-488a-9dea-f4f64fca1f14 | NCBITaxon:9825  | awards:OT2OD025340 |
| dataset:7a338939-fd82-4dbe-a1c0-3c0632fdd7ef/subjects/sub-7  | sub-7     | dataset:7a338939-fd82-4dbe-a1c0-3c0632fdd7ef | NCBITaxon:9606  | awards:OT2OD024899 |
| dataset:02d6f93c-56cd-471b-bbb9-99f65f47d203/subjects/sub-7  | sub-7     | dataset:02d6f93c-56cd-471b-bbb9-99f65f47d203 | NCBITaxon:9615  | awards:OT2OD025308 |
| dataset:60739e5f-5210-4d04-935d-9f2645b3977f/subjects/sub-7  | sub-7     | dataset:60739e5f-5210-4d04-935d-9f2645b3977f | NCBITaxon:9615  | awards:OT2OD025308 |
| dataset:3951ecbd-e20f-4650-8385-1b45f4a9b7fb/subjects/sub-7  | sub-7     | dataset:3951ecbd-e20f-4650-8385-1b45f4a9b7fb | NCBITaxon:9825  | awards:OT2OD025340 |
| dataset:6c059ef7-f94a-40af-ab5a-50f482737fc1/subjects/sub-7  | sub-7     | dataset:6c059ef7-f94a-40af-ab5a-50f482737fc1 | NCBITaxon:9825  | awards:OT2OD025340 |
| dataset:92f31530-41e6-4844-8ed8-6d1d534254f5/subjects/sub-7  | sub-7     | dataset:92f31530-41e6-4844-8ed8-6d1d534254f5 | NCBITaxon:9825  | awards:OT2OD025340 |
| dataset:7a338939-fd82-4dbe-a1c0-3c0632fdd7ef/subjects/sub-8  | sub-8     | dataset:7a338939-fd82-4dbe-a1c0-3c0632fdd7ef | NCBITaxon:9606  | awards:OT2OD024899 |
| dataset:02d6f93c-56cd-471b-bbb9-99f65f47d203/subjects/sub-8  | sub-8     | dataset:02d6f93c-56cd-471b-bbb9-99f65f47d203 | NCBITaxon:9615  | awards:OT2OD025308 |
| dataset:60739e5f-5210-4d04-935d-9f2645b3977f/subjects/sub-8  | sub-8     | dataset:60739e5f-5210-4d04-935d-9f2645b3977f | NCBITaxon:9615  | awards:OT2OD025308 |
| dataset:3951ecbd-e20f-4650-8385-1b45f4a9b7fb/subjects/sub-8  | sub-8     | dataset:3951ecbd-e20f-4650-8385-1b45f4a9b7fb | NCBITaxon:9825  | awards:OT2OD025340 |
| dataset:6c059ef7-f94a-40af-ab5a-50f482737fc1/subjects/sub-8  | sub-8     | dataset:6c059ef7-f94a-40af-ab5a-50f482737fc1 | NCBITaxon:9825  | awards:OT2OD025340 |
| dataset:92f31530-41e6-4844-8ed8-6d1d534254f5/subjects/sub-8  | sub-8     | dataset:92f31530-41e6-4844-8ed8-6d1d534254f5 | NCBITaxon:9825  | awards:OT2OD025340 |
| dataset:be6c03c9-e427-488a-9dea-f4f64fca1f14/subjects/sub-8  | sub-8     | dataset:be6c03c9-e427-488a-9dea-f4f64fca1f14 | NCBITaxon:9825  | awards:OT2OD025340 |
| dataset:7a338939-fd82-4dbe-a1c0-3c0632fdd7ef/subjects/sub-9  | sub-9     | dataset:7a338939-fd82-4dbe-a1c0-3c0632fdd7ef | NCBITaxon:9606  | awards:OT2OD024899 |
| dataset:02d6f93c-56cd-471b-bbb9-99f65f47d203/subjects/sub-9  | sub-9     | dataset:02d6f93c-56cd-471b-bbb9-99f65f47d203 | NCBITaxon:9615  | awards:OT2OD025308 |
| dataset:60739e5f-5210-4d04-935d-9f2645b3977f/subjects/sub-9  | sub-9     | dataset:60739e5f-5210-4d04-935d-9f2645b3977f | NCBITaxon:9615  | awards:OT2OD025308 |
| dataset:3951ecbd-e20f-4650-8385-1b45f4a9b7fb/subjects/sub-9  | sub-9     | dataset:3951ecbd-e20f-4650-8385-1b45f4a9b7fb | NCBITaxon:9825  | awards:OT2OD025340 |
| dataset:6c059ef7-f94a-40af-ab5a-50f482737fc1/subjects/sub-9  | sub-9     | dataset:6c059ef7-f94a-40af-ab5a-50f482737fc1 | NCBITaxon:9825  | awards:OT2OD025340 |
| dataset:92f31530-41e6-4844-8ed8-6d1d534254f5/subjects/sub-9  | sub-9     | dataset:92f31530-41e6-4844-8ed8-6d1d534254f5 | NCBITaxon:9825  | awards:OT2OD025340 |
| dataset:be6c03c9-e427-488a-9dea-f4f64fca1f14/subjects/sub-9  | sub-9     | dataset:be6c03c9-e427-488a-9dea-f4f64fca1f14 | NCBITaxon:9825  | awards:OT2OD025340 |

* Use cases
:PROPERTIES:
:header-args:sparql: :url http://localhost:9999/blazegraph/sparql
:header-args:sparql+: :format text/csv
:header-args:sparql+: :results table
:header-args:sparql+: :var limit="10"
:END:
** ApiNATOMY
*** Summary statistics
# aka dashboard queries
ApiNATOMY sourced

1. number of lyphs
   generated vs input
   s? rdf:type element:Lyph
   #+begin_src sparql :var limit="200"
   SELECT DISTINCT
   (COUNT(DISTINCT ?s) as ?input_lyphs)
   #?s
   #?p
   #?o
   WHERE {
     ?s a elements:Lyph .
     #?s ?p ?o .
     FILTER NOT EXISTS { ?s apinatomy:isTemplate true . }
     FILTER NOT EXISTS { ?s apinatomy:generated true . }
     #FILTER ( ! ( ?p = apinatomy:isTemplate && ?o = true ) )
     #FILTER ( ! ( ?p = apinatomy:generated && ?o = true ) )
     #?s apinatomy:generated ?o .
   }
   LIMIT ?limit
   #+end_src

   #+RESULTS:
   | input_lyphs |
   |-------------|
   |         763 |

   #+begin_src sparql
   SELECT (COUNT(DISTINCT ?s) as ?total_lyphs)
   WHERE { ?s a elements:Lyph . }
   #+end_src

   #+RESULTS:
   | total_lyphs |
   |-------------|
   |        7751 |

2. publications referenced
   apinaomty:publications
   average number of publications per unit? (for now no)
   will also want the full listing of publications
   select count distinct o?
   select distinct o?
   s? apinat:publication o?
   #+begin_src sparql
   SELECT DISTINCT
   (COUNT(DISTINCT ?pub) as ?publications)
   WHERE { ?s apinatomy:publications ?pub . }
   #+end_src

   #+RESULTS:
   | publications |
   |--------------|
   |           26 |

3. species
   both model level and lyph level
4. terms employed in annotation
   count of apinatomy:external by prefix UBERON, GO, CHEBI, etc.
   full listing of terms as well
   select count distinct o?
   select distinct o?
   s? apinat:external o?
   #+begin_src sparql
   SELECT
   ?prefix
   (COUNT(?s) AS ?count)
   WHERE {
     VALUES ?prefix {
       "UBERON" "EMAPA" "fma" "CHEBI" "GO" "sao" "CL" "nlx" "ilx" "tgbugs" "NCBITaxon"
       "pubmed" "doi" "ncit" # problems
       "" }
     ?s a elements:External .
     FILTER CONTAINS(str(?s), ?prefix)
   }
   GROUP BY ?prefix
   ORDER BY ?count
   #+end_src

   #+RESULTS:
   | prefix    | count |
   |-----------+-------|
   | CL        |     1 |
   | nlx       |     1 |
   | doi       |     1 |
   | sao       |     2 |
   | NCBITaxon |     2 |
   | ncit      |     4 |
   | GO        |     5 |
   | CHEBI     |    11 |
   | EMAPA     |    17 |
   | tgbugs    |    20 |
   | pubmed    |    26 |
   | ilx       |    76 |
   | fma       |    89 |
   | UBERON    |   182 |
   |           |   437 |

5. external issues
   publications appearing as external ids, unmapped prefixes etc.
   #+begin_src sparql :var limit="500"
   SELECT DISTINCT
   ?l ?s
   WHERE {
       ?s a elements:External .
       ?l ?p ?s .
       FILTER(CONTAINS(str(?s), "doi") || CONTAINS(str(?s), "pubmed") || CONTAINS(str(?s), "ncit"))
   }
   ORDER BY ?l ?s
   LIMIT ?limit
   #+end_src

5. number of neurulated groups aka neuron populations

NPO sourced
Keast
Bolser Lewis
First pass NLP output

1. number of neuron populations aka neuron types
   # TODO load NPO, and we have to use robot to reason the NPO graph
   #+begin_src sparql
   SELECT DISTINCT
   ?s
   WHERE {
       ?s rdfs:subClassOf+ SAO:1813327414 . # NOTE this counts cells
   }
   #+end_src
2. number of distinct phenotypes
3. number of dimensions
4. number of phenotype values per phenotype dimension
   1. number of anatomical regions
   2. number of species
   3. number of ...

* Bootstrap :noexport:
:PROPERTIES:
:visibility:  folded
:END:
#+name: orgstrap
#+begin_src elisp :results none :lexical yes
(defvar orgstrap-do-packages-emacs t "Install Emacs packages.")

(defun orgstrap---noconfirm-eval-sparql (lang _body)
  "Run sparql queries without confirmation dialogue."
  (not (string= lang "sparql")))
(setq-local ocbe org-confirm-babel-evaluate) ; hack that works due to dynamic scope

;; TODO
;;(defun orgstrap---advise-sparql-execute-query (&rest args)
;;  (compactify-current-buffer default-curies))

;;(advice-add #'sparql-execute-query :after #'orgstrap---advise-sparql-execute-query)
#+end_src

** Local Variables :ARCHIVE:

# Local Variables:
# eval: (progn (setq-local orgstrap-min-org-version "8.2.10") (let ((actual (org-version)) (need orgstrap-min-org-version)) (or (fboundp #'orgstrap--confirm-eval) (not need) (string< need actual) (string= need actual) (error "Your Org is too old! %s < %s" actual need))) (defun orgstrap-norm-func--prp-1\.1 (body) (let (print-quoted print-length print-level) (prin1-to-string (read (concat "(progn\n" body "\n)"))))) (unless (boundp 'orgstrap-norm-func) (defvar orgstrap-norm-func orgstrap-norm-func-name)) (defun orgstrap-norm-embd (body) (funcall orgstrap-norm-func body)) (unless (fboundp #'orgstrap-norm) (defalias 'orgstrap-norm #'orgstrap-norm-embd)) (defun orgstrap-org-src-coderef-regexp (_fmt &optional label) (let ((fmt org-coderef-label-format)) (format "\\([:blank:]*\\(%s\\)[:blank:]*\\)$" (replace-regexp-in-string "%s" (if label (regexp-quote label) "\\([-a-zA-Z0-9_][-a-zA-Z0-9_ ]*\\)") (regexp-quote fmt) nil t)))) (unless (fboundp #'org-src-coderef-regexp) (defalias 'org-src-coderef-regexp #'orgstrap-org-src-coderef-regexp)) (defun orgstrap--expand-body (info) (let ((coderef (nth 6 info)) (expand (if (org-babel-noweb-p (nth 2 info) :eval) (org-babel-expand-noweb-references info) (nth 1 info)))) (if (not coderef) expand (replace-regexp-in-string (org-src-coderef-regexp coderef) "" expand nil nil 1)))) (defun orgstrap--confirm-eval-portable (lang _body) (not (and (member lang '("elisp" "emacs-lisp")) (let* ((body (orgstrap--expand-body (org-babel-get-src-block-info))) (body-normalized (orgstrap-norm body)) (content-checksum (intern (secure-hash orgstrap-cypher body-normalized)))) (eq orgstrap-block-checksum content-checksum))))) (defalias 'orgstrap--confirm-eval #'orgstrap--confirm-eval-portable) (let ((ocbe org-confirm-babel-evaluate)) (setq-local orgstrap-norm-func orgstrap-norm-func-name) (setq-local org-confirm-babel-evaluate #'orgstrap--confirm-eval) (unwind-protect (save-excursion (org-babel-goto-named-src-block "orgstrap") (org-babel-execute-src-block)) (setq-local org-confirm-babel-evaluate ocbe) (org-set-startup-visibility))))
# End:
